MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/ll/stm32c5xx_ll_flash.h
/**
  **********************************************************************************************************************
  * @file    stm32c5xx_ll_flash.h
  * @brief   Header file of FLASH LL module.
  **********************************************************************************************************************
  * @attention
  *
  * Copyright (c) 2026 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  **********************************************************************************************************************
  */

/* Define to prevent recursive inclusion -----------------------------------------------------------------------------*/
#ifndef STM32C5XX_LL_FLASH_H
#define STM32C5XX_LL_FLASH_H

#ifdef __cplusplus
extern "C" {
#endif /* __cplusplus */

/* Includes ----------------------------------------------------------------------------------------------------------*/
#include "stm32c5xx.h"

/** @addtogroup STM32C5xx_LL_Driver
  * @{
  */

#if defined (FLASH)

/** @defgroup FLASH_LL FLASH
  * @{
  */

/** @defgroup FLASH_LL_Exported_Constants LL FLASH Constants
  * @{
  */

/** @defgroup FLASH_Interrupt_Flags FLASH Interrupt flags
  * @{
  */
#define LL_FLASH_IT_EOP             FLASH_CR_EOPIE                     /*!< End of operation interrupt flag           */
#define LL_FLASH_IT_WRPERR          FLASH_CR_WRPERRIE                  /*!< Write protection error interrupt flag     */
#define LL_FLASH_IT_PGSERR          FLASH_CR_PGSERRIE                  /*!< Programming sequence error interrupt flag */
#define LL_FLASH_IT_STRBERR         FLASH_CR_STRBERRIE                 /*!< Strobe error interrupt flag               */
#define LL_FLASH_IT_INCERR          FLASH_CR_INCERRIE                  /*!< Inconsistency error interrupt flag        */
#define LL_FLASH_IT_OPTCHANGEERR    FLASH_CR_OPTCHANGEERRIE            /*!< Option-byte change error interrupt flag   */
#define LL_FLASH_IT_ERRORS_ALL      (FLASH_CR_WRPERRIE | FLASH_CR_PGSERRIE | FLASH_CR_STRBERRIE \
                                     | FLASH_CR_INCERRIE | FLASH_CR_OPTCHANGEERRIE) /* All error interrupts           */
#define LL_FLASH_IT_ALL             (FLASH_CR_EOPIE | LL_FLASH_IT_ERRORS_ALL)       /* All interrupt flags            */
/**
  * @}
  */

/** @defgroup FLASH_Interrupted_Operation_Area_Flags FLASH Interrupted Operation Area flags
  * @{
  */
#define LL_FLASH_FLAG_DATA_OP        FLASH_OPSR_DATA_OP             /* Interrupted operation in data flash flag */
#define LL_FLASH_FLAG_BK_OP          FLASH_OPSR_BK_OP               /* Interrupted operation bank flag          */
#define LL_FLASH_FLAG_OTP_OP         FLASH_OPSR_OTP_OP              /* Interrupted operation in OTP flash flag  */
#define LL_FLASH_FLAG_OP_AREA_ALL    (FLASH_OPSR_DATA_OP \
                                      | FLASH_OPSR_BK_OP \
                                      | FLASH_OPSR_OTP_OP)          /* All interrupted operation area flags     */
/**
  * @}
  */

/** @defgroup FLASH_Status_Flags FLASH Status flags
  * @{
  */
#define LL_FLASH_FLAG_BSY             FLASH_SR_BSY                        /*!< Busy flag                    */
#define LL_FLASH_FLAG_WBNE            FLASH_SR_WBNE                       /*!< Write buffer not empty flag  */
#define LL_FLASH_FLAG_DBNE            FLASH_SR_DBNE                       /*!< Data buffer not empty flag   */
#define LL_FLASH_FLAG_STATUS_ALL      (FLASH_SR_BSY | FLASH_SR_WBNE | FLASH_SR_DBNE) /*!< All Status flags  */
/**
  * @}
  */

/** @defgroup FLASH_Error_Flags FLASH Error flags
  * @{
  */
#define LL_FLASH_FLAG_WRPERR          FLASH_SR_WRPERR                 /*!< Write protection error flag     */
#define LL_FLASH_FLAG_PGSERR          FLASH_SR_PGSERR                 /*!< Programming sequence error flag */
#define LL_FLASH_FLAG_STRBERR         FLASH_SR_STRBERR                /*!< Strobe error flag               */
#define LL_FLASH_FLAG_INCERR          FLASH_SR_INCERR                 /*!< Inconsistency error flag        */
#define LL_FLASH_FLAG_OPTCHANGEERR    FLASH_SR_OPTCHANGEERR           /*!< Option-byte change error flag   */
#define LL_FLASH_FLAG_ERRORS_ALL      (FLASH_SR_WRPERR | FLASH_SR_PGSERR | FLASH_SR_STRBERR \
                                       | FLASH_SR_INCERR | FLASH_SR_OPTCHANGEERR)     /*!< All error flags */
#define LL_FLASH_FLAG_EOP             FLASH_SR_EOP                    /*!< End of Operation flag           */
/**
  * @}
  */

/** @defgroup FLASH_ECC_Error_Flags FLASH ECC Error flags
  * @{
  */
#define LL_FLASH_FLAG_ECCC            FLASH_ECCCORR_ECCC                 /*!< ECC single error flag */
#define LL_FLASH_FLAG_ECCD            FLASH_ECCDETR_ECCD                 /*!< ECC double error flag */
/**
  * @}
  */

/** @defgroup FLASH_ECC_Area_Flags FLASH ECC Area flags
  * @{
  */
#define LL_FLASH_FLAG_EDATA_ECC       FLASH_ECCCORR_EDATA_ECC            /* ECC error in data flash flag   */
#define LL_FLASH_FLAG_BK_ECC          FLASH_ECCCORR_BK_ECC               /* ECC error bank flag            */
#define LL_FLASH_FLAG_SYSF_ECC        FLASH_ECCCORR_SYSF_ECC             /* ECC error in system flash flag */
#define LL_FLASH_FLAG_OTP_ECC         FLASH_ECCCORR_OTP_ECC              /* ECC error in OTP flash flag    */
#define LL_FLASH_FLAG_ECC_AREA_ALL    (FLASH_ECCCORR_EDATA_ECC | FLASH_ECCCORR_BK_ECC \
                                       | FLASH_ECCCORR_SYSF_ECC | FLASH_ECCCORR_OTP_ECC) /* All ECC error area flags */
/**
  * @}
  */

/** @defgroup FLASH_Latency FLASH Latency
  * @{
  */
#define LL_FLASH_LATENCY_0WS  0x00000000U          /*!< Zero wait state      */
#define LL_FLASH_LATENCY_1WS  FLASH_ACR_LATENCY_0  /*!< One wait state       */
#define LL_FLASH_LATENCY_2WS  FLASH_ACR_LATENCY_1  /*!< Two wait states      */
#define LL_FLASH_LATENCY_3WS  FLASH_ACR_LATENCY_2  /*!< Three wait states    */
#define LL_FLASH_LATENCY_4WS  FLASH_ACR_LATENCY_3  /*!< Four wait states     */
#define LL_FLASH_LATENCY_5WS  FLASH_ACR_LATENCY_4  /*!< Five wait states     */
#define LL_FLASH_LATENCY_6WS  FLASH_ACR_LATENCY_5  /*!< Six wait states      */
#define LL_FLASH_LATENCY_7WS  FLASH_ACR_LATENCY_6  /*!< Seven wait states    */
#define LL_FLASH_LATENCY_8WS  FLASH_ACR_LATENCY_7  /*!< Eight wait states    */
#define LL_FLASH_LATENCY_9WS  FLASH_ACR_LATENCY_8  /*!< Nine wait states     */
#define LL_FLASH_LATENCY_10WS FLASH_ACR_LATENCY_9  /*!< Ten wait states      */
#define LL_FLASH_LATENCY_11WS FLASH_ACR_LATENCY_10 /*!< Eleven wait states   */
#define LL_FLASH_LATENCY_12WS FLASH_ACR_LATENCY_11 /*!< Twelve wait states   */
#define LL_FLASH_LATENCY_13WS FLASH_ACR_LATENCY_12 /*!< Thirteen wait states */
#define LL_FLASH_LATENCY_14WS FLASH_ACR_LATENCY_13 /*!< Fourteen wait states */
#define LL_FLASH_LATENCY_15WS FLASH_ACR_LATENCY_14 /*!< Fifteen wait states  */
/**
  * @}
  */

/** @defgroup FLASH_ProgrammingDelay FLASH Programming Delay
  * @{
  */
#define LL_FLASH_PROGRAM_DELAY_0 0x00000000U                /*!< Programming delay for Flash frequency at 68 MHz or
                                                                 less */
#define LL_FLASH_PROGRAM_DELAY_1 FLASH_ACR_WRHIGHFREQ_0     /*!< Programming delay for Flash frequency between 68 MHz
                                                                 and 136 MHz */
#define LL_FLASH_PROGRAM_DELAY_2 FLASH_ACR_WRHIGHFREQ_1     /*!< Programming delay for Flash frequency between 136 MHz
                                                                 and 170 MHz */
#define LL_FLASH_PROGRAM_DELAY_3 (FLASH_ACR_WRHIGHFREQ_1 \
                                  | FLASH_ACR_WRHIGHFREQ_0) /*!< Programming delay for Flash frequency at 170 MHz or
                                                                 above */
/**
  * @}
  */

/** @defgroup FLASH_EmptyBootLocation FLASH Empty Boot Location
  * @{
  */
#define LL_FLASH_BOOT_LOCATION_PROGRAMMED 0x00000000U   /*!< Boot location is programmed */
#define LL_FLASH_BOOT_LOCATION_EMPTY FLASH_ACR_EMPTY    /*!< Boot location is empty */
/**
  * @}
  */

/** @defgroup FLASH_privilege_items  FLASH Privilege items
  * @{
  */
#define LL_FLASH_PRIV_ITEM_ALL     FLASH_PRIVCFGR_PRIV   /*!< All privilege items  */
/**
  * @}
  */

/** @defgroup FLASH_privilege_attribute  Privilege attribute
  * @{
  */
#define LL_FLASH_ATTR_NPRIV     0U   /*!< Non-privileged attribute  */
#define LL_FLASH_ATTR_PRIV      1U   /*!< Privileged attribute      */
/**
  * @}
  */

/** @defgroup FLASH_Unlock_Keys FLASH Unlock Keys
  * @{
  */
#define LL_FLASH_KEY1 0x45670123U /*!< Lock key1 */
#define LL_FLASH_KEY2 0xCDEF89ABU /*!< Lock key2 */
/**
  * @}
  */

