MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/ll/stm32c5xx_ll_flash.h
/** @defgroup FLASH_OB_Unlock_Keys FLASH OB Unlock Keys
  * @{
  */
#define LL_FLASH_OB_OPTKEY1 0x08192A3BU /*!< Option-byte lock key1 */
#define LL_FLASH_OB_OPTKEY2 0x4C5D6E7FU /*!< Option-byte lock key2 */
/**
  * @}
  */

/** @defgroup FLASH_Bank_Selection FLASH Bank Selection
  * @{
  */
#define LL_FLASH_BANK_1 0x0U    /*!< Bank 1 selection */
#define LL_FLASH_BANK_2 0x1U    /*!< Bank 2 selection */
/**
  * @}
  */

/** @defgroup FLASH_Erase_Bank_Selection FLASH Erase Bank Selection
  * @{
  */
#define LL_FLASH_ERASE_BANK_1 0x00000000U       /*!< Page erase bank 1 */
#define LL_FLASH_ERASE_BANK_2 FLASH_CR_BKSEL    /*!< Page erase bank 2 */
/**
  * @}
  */
/** @defgroup FLASH_Erase_Area_Selection FLASH Erase Area Selection
  * @{
  */
#define LL_FLASH_ERASE_USER_AREA  0x00000000U       /*!< Page erase USER area  */
#define LL_FLASH_ERASE_EDATA_AREA FLASH_CR_EDATASEL /*!< Page erase EDATA area */
/**
  * @}
  */


/** @defgroup FLASH_OB_Reset_Generation_Stop_Mode FLASH OB Reset Generation Stop Mode
  * @{
  */
#define LL_FLASH_OB_RST_STOP_MODE    0x00000000U               /*!< Reset in stop mode OB    */
#define LL_FLASH_OB_NO_RST_STOP_MODE FLASH_OPTSR_PRG_NRST_STOP /*!< No reset in stop mode OB */
/**
  * @}
  */

/** @defgroup FLASH_OB_Reset_Generation_Standby_Mode FLASH OB Reset Generation standby Mode
  * @{
  */
#define LL_FLASH_OB_RST_STDBY_MODE    0x00000000U                /*!< Reset in standby mode OB    */
#define LL_FLASH_OB_NO_RST_STDBY_MODE FLASH_OPTSR_PRG_NRST_STDBY /*!< No reset in standby mode OB */
/**
  * @}
  */

/** @defgroup FLASH_OB_Erase_Sram1_System_Reset FLASH OB Erase Sram1 System Reset
  * @{
  */
#define LL_FLASH_OB_ERASED_SRAM1_SYS_RST     0x00000000U                /*!< Erased sram1 after system reset OB */
#define LL_FLASH_OB_NOT_ERASED_SRAM1_SYS_RST FLASH_OPTSR2_PRG_SRAM1_RST /*!< Not erased sram1 after system reset OB */
/**
  * @}
  */

/** @defgroup FLASH_OB_Erase_Sram2_System_Reset FLASH OB Erase Sram2 System Reset
  * @{
  */
#define LL_FLASH_OB_ERASED_SRAM2_SYS_RST     0x00000000U                /*!< Erased sram2 after system reset OB     */
#define LL_FLASH_OB_NOT_ERASED_SRAM2_SYS_RST FLASH_OPTSR2_PRG_SRAM2_RST /*!< Not erased sram2 after system reset OB */
/**
  * @}
  */

/** @defgroup FLASH_OB_IWDG_HW_SW_Selection FLASH OB IWDG HW SW Selection
  * @{
  */
#define LL_FLASH_OB_IWDG_HW 0x00000000U             /*!< IWDG Hardware selection OB */
#define LL_FLASH_OB_IWDG_SW FLASH_OPTSR_PRG_IWDG_SW /*!< IWDG Software selection OB */
/**
  * @}
  */

/** @defgroup FLASH_OB_WWDG_HW_SW_Selection FLASH OB WWDG HW SW Selection
  * @{
  */
#define LL_FLASH_OB_WWDG_HW 0x00000000U             /*!< WWDG Hardware selection OB */
#define LL_FLASH_OB_WWDG_SW FLASH_OPTSR_PRG_WWDG_SW /*!< WWDG Software selection OB */
/**
  * @}
  */

/** @defgroup FLASH_OB_Single_Dual_Bank FLASH OB Dual Bank 256K
  * @{
  */
#define LL_FLASH_OB_DUAL_BANK     0x00000000U                 /*!< Dual bank OB   */
#define LL_FLASH_OB_SINGLE_BANK   FLASH_OPTSR_PRG_SINGLE_BANK /*!< Single bank OB */
/**
  * @}
  */

/** @defgroup FLASH_OB_Swap_Bank FLASH OB Swap Bank
  * @{
  */
#define LL_FLASH_OB_BANK_NOT_SWAPPED 0x00000000U               /*!< Bank not swapped OB */
#define LL_FLASH_OB_BANK_SWAPPED     FLASH_OPTSR_PRG_SWAP_BANK /*!< Bank swapped OB     */
/**
  * @}
  */

/** @defgroup FLASH_HDPEXT_Bank_Selection FLASH HDPEXT Bank Selection
  * @{
  */
#define LL_FLASH_HDPEXT_BANK_1 FLASH_HDPEXTR_HDP1_EXT_Pos  /*!< HDPEXT bank 1 */
#define LL_FLASH_HDPEXT_BANK_2 FLASH_HDPEXTR_HDP2_EXT_Pos  /*!< HDPEXT bank 2 */
/**
  * @}
  */

/** @defgroup FLASH_OB_BootAddr_Lock FLASH OB Boot Address Lock
  * @{
  */
#define LL_FLASH_OB_BOOT_NOT_LOCKED 0xC3U /*!< Boot OBs not locked  */
#define LL_FLASH_OB_BOOT_LOCKED     0xB4U /*!< Boot OBs locked      */
/**
  * @}
  */

/** @defgroup FLASH_OB_Boot0_Selection FLASH OB Boot0 Selection
  * @{
  */
#define LL_FLASH_OB_BOOT0_BOOTBIT 0x00000000U              /*!< Boot0 selection OB    */
#define LL_FLASH_OB_BOOT0_BOOTPIN FLASH_OPTSR_PRG_BOOT_SEL /*!< Boot pin selection OB */
/**
  * @}
  */

/** @defgroup FLASH_OB_BOOT0_Option FLASH OB BOOT0 Option bit
  * @{
  */
#define LL_FLASH_OB_BOOT0_DISABLED 0x00000000U          /*!< BOOT0 value 0 OB */
#define LL_FLASH_OB_BOOT0_ENABLED FLASH_OPTSR_PRG_BOOT0 /*!< BOOT0 value 1 OB */
/**
  * @}
  */

/** @defgroup FLASH_OB_Read_Protection_Level FLASH OB Read Protection Level
  * @{
  */
#define LL_FLASH_OB_RDP_LEVEL_0     0xEDU /*!< RDP Level 0 OB                    */
#define LL_FLASH_OB_RDP_LEVEL_2_WBS 0xD1U /*!< RDP Level 2 with Boundary Scan OB */
#define LL_FLASH_OB_RDP_LEVEL_2     0x72U /*!< RDP Level 2 OB                    */
/**
  * @}
  */

/** @defgroup LL_FLASH_OB_Write_Protection_Pages FLASH OB Write Protection Pages
  * @{
  */
#if defined(FLASH_WRP_GROUP_WIDTH) && (FLASH_WRP_GROUP_WIDTH == 2U)
#define LL_FLASH_OB_WRP_PAGE_0_1    0x00000001UL               /*!< Write protection of Page0 & 1   */
#define LL_FLASH_OB_WRP_PAGE_2_3    0x00000002UL               /*!< Write protection of Page2 & 3   */
#define LL_FLASH_OB_WRP_PAGE_4_5    0x00000004UL               /*!< Write protection of Page4 & 5   */
#define LL_FLASH_OB_WRP_PAGE_6_7    0x00000008UL               /*!< Write protection of Page6 & 7   */
#define LL_FLASH_OB_WRP_PAGE_8_9    0x00000010UL               /*!< Write protection of Page8 & 9   */
#define LL_FLASH_OB_WRP_PAGE_10_11  0x00000020UL               /*!< Write protection of Page10 & 11 */
#define LL_FLASH_OB_WRP_PAGE_12_13  0x00000040UL               /*!< Write protection of Page12 & 13 */
#define LL_FLASH_OB_WRP_PAGE_14_15  0x00000080UL               /*!< Write protection of Page14 & 15 */
#define LL_FLASH_OB_WRP_PAGE_16_17  0x00000100UL               /*!< Write protection of Page16 & 17 */
#define LL_FLASH_OB_WRP_PAGE_18_19  0x00000200UL               /*!< Write protection of Page18 & 19 */
#define LL_FLASH_OB_WRP_PAGE_20_21  0x00000400UL               /*!< Write protection of Page20 & 21 */
#define LL_FLASH_OB_WRP_PAGE_22_23  0x00000800UL               /*!< Write protection of Page22 & 23 */
#define LL_FLASH_OB_WRP_PAGE_24_25  0x00001000UL               /*!< Write protection of Page24 & 25 */
#define LL_FLASH_OB_WRP_PAGE_26_27  0x00002000UL               /*!< Write protection of Page26 & 27 */
#define LL_FLASH_OB_WRP_PAGE_28_29  0x00004000UL               /*!< Write protection of Page28 & 29 */
#define LL_FLASH_OB_WRP_PAGE_30_31  0x00008000UL               /*!< Write protection of Page30 & 31 */
#define LL_FLASH_OB_WRP_PAGE_32_33  0x00010000UL               /*!< Write protection of Page32 & 33 */
#define LL_FLASH_OB_WRP_PAGE_34_35  0x00020000UL               /*!< Write protection of Page34 & 35 */
#define LL_FLASH_OB_WRP_PAGE_36_37  0x00040000UL               /*!< Write protection of Page36 & 37 */
#define LL_FLASH_OB_WRP_PAGE_38_39  0x00080000UL               /*!< Write protection of Page38 & 39 */
#define LL_FLASH_OB_WRP_PAGE_40_41  0x00100000UL               /*!< Write protection of Page40 & 41 */
#define LL_FLASH_OB_WRP_PAGE_42_43  0x00200000UL               /*!< Write protection of Page42 & 43 */
#define LL_FLASH_OB_WRP_PAGE_44_45  0x00400000UL               /*!< Write protection of Page44 & 45 */
#define LL_FLASH_OB_WRP_PAGE_46_47  0x00800000UL               /*!< Write protection of Page46 & 47 */
#define LL_FLASH_OB_WRP_PAGE_48_49  0x01000000UL               /*!< Write protection of Page48 & 49 */
#define LL_FLASH_OB_WRP_PAGE_50_51  0x02000000UL               /*!< Write protection of Page50 & 51 */
#define LL_FLASH_OB_WRP_PAGE_52_53  0x04000000UL               /*!< Write protection of Page52 & 53 */
#define LL_FLASH_OB_WRP_PAGE_54_55  0x08000000UL               /*!< Write protection of Page54 & 55 */
#define LL_FLASH_OB_WRP_PAGE_56_57  0x10000000UL               /*!< Write protection of Page56 & 57 */
#define LL_FLASH_OB_WRP_PAGE_58_59  0x20000000UL               /*!< Write protection of Page58 & 59 */
#define LL_FLASH_OB_WRP_PAGE_60_61  0x40000000UL               /*!< Write protection of Page60 & 61 */
#define LL_FLASH_OB_WRP_PAGE_62_63  0x80000000UL               /*!< Write protection of Page62 & 63 */
#else
#define LL_FLASH_OB_WRP_PAGE_0      0x00000001UL               /*!< Write protection of Page0  */
#define LL_FLASH_OB_WRP_PAGE_1      0x00000002UL               /*!< Write protection of Page1  */
#define LL_FLASH_OB_WRP_PAGE_2      0x00000004UL               /*!< Write protection of Page2  */
#define LL_FLASH_OB_WRP_PAGE_3      0x00000008UL               /*!< Write protection of Page3  */
#define LL_FLASH_OB_WRP_PAGE_4      0x00000010UL               /*!< Write protection of Page4  */
#define LL_FLASH_OB_WRP_PAGE_5      0x00000020UL               /*!< Write protection of Page5  */
#define LL_FLASH_OB_WRP_PAGE_6      0x00000040UL               /*!< Write protection of Page6  */
#define LL_FLASH_OB_WRP_PAGE_7      0x00000080UL               /*!< Write protection of Page7  */
#define LL_FLASH_OB_WRP_PAGE_8      0x00000100UL               /*!< Write protection of Page8  */
#define LL_FLASH_OB_WRP_PAGE_9      0x00000200UL               /*!< Write protection of Page9  */
#define LL_FLASH_OB_WRP_PAGE_10     0x00000400UL               /*!< Write protection of Page10 */
#define LL_FLASH_OB_WRP_PAGE_11     0x00000800UL               /*!< Write protection of Page11 */
#define LL_FLASH_OB_WRP_PAGE_12     0x00001000UL               /*!< Write protection of Page12 */
#define LL_FLASH_OB_WRP_PAGE_13     0x00002000UL               /*!< Write protection of Page13 */
#define LL_FLASH_OB_WRP_PAGE_14     0x00004000UL               /*!< Write protection of Page14 */
#define LL_FLASH_OB_WRP_PAGE_15     0x00008000UL               /*!< Write protection of Page15 */
#define LL_FLASH_OB_WRP_PAGE_16     0x00010000UL               /*!< Write protection of Page16 */
#define LL_FLASH_OB_WRP_PAGE_17     0x00020000UL               /*!< Write protection of Page17 */
#define LL_FLASH_OB_WRP_PAGE_18     0x00040000UL               /*!< Write protection of Page18 */
#define LL_FLASH_OB_WRP_PAGE_19     0x00080000UL               /*!< Write protection of Page19 */
#define LL_FLASH_OB_WRP_PAGE_20     0x00100000UL               /*!< Write protection of Page20 */
#define LL_FLASH_OB_WRP_PAGE_21     0x00200000UL               /*!< Write protection of Page21 */
#define LL_FLASH_OB_WRP_PAGE_22     0x00400000UL               /*!< Write protection of Page22 */
#define LL_FLASH_OB_WRP_PAGE_23     0x00800000UL               /*!< Write protection of Page23 */
#define LL_FLASH_OB_WRP_PAGE_24     0x01000000UL               /*!< Write protection of Page24 */
#define LL_FLASH_OB_WRP_PAGE_25     0x02000000UL               /*!< Write protection of Page25 */
#define LL_FLASH_OB_WRP_PAGE_26     0x04000000UL               /*!< Write protection of Page26 */
#define LL_FLASH_OB_WRP_PAGE_27     0x08000000UL               /*!< Write protection of Page27 */
#define LL_FLASH_OB_WRP_PAGE_28     0x10000000UL               /*!< Write protection of Page28 */
#define LL_FLASH_OB_WRP_PAGE_29     0x20000000UL               /*!< Write protection of Page29 */
#define LL_FLASH_OB_WRP_PAGE_30     0x40000000UL               /*!< Write protection of Page30 */
#define LL_FLASH_OB_WRP_PAGE_31     0x80000000UL               /*!< Write protection of Page31 */
#endif /* (FLASH_WRP_GROUP_WIDTH == 2U) */
#define LL_FLASH_OB_WRP_PAGE_ALL    FLASH_WRP1R_PRG_WRPSG1_Msk /*!< Write protection of all Pages */
/**
  * @}
  */

