MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/ll/stm32c5xx_ll_flash.h
/** @defgroup LL_FLASH_OB_OTP_Lock_Blocks FLASH OTP Lock Blocks
  * @{
  */
#define LL_FLASH_OB_OTP_BLK_0       0x00000001UL                /*!< OTP Lock Block0  */
#define LL_FLASH_OB_OTP_BLK_1       0x00000002UL                /*!< OTP Lock Block1  */
#define LL_FLASH_OB_OTP_BLK_2       0x00000004UL                /*!< OTP Lock Block2  */
#define LL_FLASH_OB_OTP_BLK_3       0x00000008UL                /*!< OTP Lock Block3  */
#define LL_FLASH_OB_OTP_BLK_4       0x00000010UL                /*!< OTP Lock Block4  */
#define LL_FLASH_OB_OTP_BLK_5       0x00000020UL                /*!< OTP Lock Block5  */
#define LL_FLASH_OB_OTP_BLK_6       0x00000040UL                /*!< OTP Lock Block6  */
#define LL_FLASH_OB_OTP_BLK_7       0x00000080UL                /*!< OTP Lock Block7  */
#define LL_FLASH_OB_OTP_BLK_8       0x00000100UL                /*!< OTP Lock Block8  */
#define LL_FLASH_OB_OTP_BLK_9       0x00000200UL                /*!< OTP Lock Block9  */
#define LL_FLASH_OB_OTP_BLK_10      0x00000400UL                /*!< OTP Lock Block10 */
#define LL_FLASH_OB_OTP_BLK_11      0x00000800UL                /*!< OTP Lock Block11 */
#define LL_FLASH_OB_OTP_BLK_12      0x00001000UL                /*!< OTP Lock Block12 */
#define LL_FLASH_OB_OTP_BLK_13      0x00002000UL                /*!< OTP Lock Block13 */
#define LL_FLASH_OB_OTP_BLK_14      0x00004000UL                /*!< OTP Lock Block14 */
#define LL_FLASH_OB_OTP_BLK_15      0x00008000UL                /*!< OTP Lock Block15 */
#define LL_FLASH_OB_OTP_BLK_16      0x00010000UL                /*!< OTP Lock Block16 */
#define LL_FLASH_OB_OTP_BLK_17      0x00020000UL                /*!< OTP Lock Block17 */
#define LL_FLASH_OB_OTP_BLK_18      0x00040000UL                /*!< OTP Lock Block18 */
#define LL_FLASH_OB_OTP_BLK_19      0x00080000UL                /*!< OTP Lock Block19 */
#define LL_FLASH_OB_OTP_BLK_20      0x00100000UL                /*!< OTP Lock Block20 */
#define LL_FLASH_OB_OTP_BLK_21      0x00200000UL                /*!< OTP Lock Block21 */
#define LL_FLASH_OB_OTP_BLK_22      0x00400000UL                /*!< OTP Lock Block22 */
#define LL_FLASH_OB_OTP_BLK_23      0x00800000UL                /*!< OTP Lock Block23 */
#define LL_FLASH_OB_OTP_BLK_ALL     FLASH_OTPBLR_PRG_LOCKBL_Msk /*!< OTP Lock All Blocks */
/**
  * @}
  */

/** @defgroup FLASH_Interrupted_Operation_Code FLASH Interrupted Operation Code
  * @{
  */
#define LL_FLASH_INTERRUPTED_NO_OPERATION 0x00000000U                                   /*!< No operation interrupted */
#define LL_FLASH_INTERRUPTED_SINGLE_WRITE FLASH_OPSR_CODE_OP_0                          /*!< Single write interrupted */
#define LL_FLASH_INTERRUPTED_PAGE_ERASE   (FLASH_OPSR_CODE_OP_1 | FLASH_OPSR_CODE_OP_0) /*!< Page erase interrupted   */
#define LL_FLASH_INTERRUPTED_BANK_ERASE   FLASH_OPSR_CODE_OP_2                          /*!< Bank erase interrupted   */
#define LL_FLASH_INTERRUPTED_MASS_ERASE   (FLASH_OPSR_CODE_OP_2 | FLASH_OPSR_CODE_OP_0) /*!< Mass erase interrupted   */
#define LL_FLASH_INTERRUPTED_OB_CHANGE    (FLASH_OPSR_CODE_OP_2 | FLASH_OPSR_CODE_OP_1) /*!< OB change interrupted    */
/**
  * @}
  */

/**
  * @}
  */

/* Exported macro ----------------------------------------------------------------------------------------------------*/
/** @defgroup FLASH_LL_Exported_Macros LL FLASH Macros
  * @{
  */

/**
  * @brief  Write a value in FLASH register.
  * @param  instance FLASH instance.
  * @param  reg      Register to be written.
  * @param  value    Value to be written in the register.
  */
#define LL_FLASH_WRITE_REG(instance, reg, value) STM32_WRITE_REG((instance)->reg, (value))

/**
  * @brief  Read a value in FLASH register.
  * @param  instance FLASH instance.
  * @param  reg      Register to be read
  * @retval Register value
  */
#define LL_FLASH_READ_REG(instance, reg) STM32_READ_REG((instance)->reg)
/**
  * @}
  */

/* Exported functions ------------------------------------------------------------------------------------------------*/

/** @defgroup FLASH_LL_Exported_Functions LL FLASH Functions
  * @{
  */

/** @defgroup FLASH_LL_EF_Configuration LL FLASH Configuration
  * @{
  */

/**
  * @brief  Set Flash latency.
  * @rmtoll
  *  ACR           LATENCY           LL_FLASH_SetLatency
  * @param  flashx FLASH instance.
  * @param  latency
  *         This parameter can be one of the following values:
  *         @arg @ref LL_FLASH_LATENCY_0WS
  *         @arg @ref LL_FLASH_LATENCY_1WS
  *         @arg @ref LL_FLASH_LATENCY_2WS
  *         @arg @ref LL_FLASH_LATENCY_3WS
  *         @arg @ref LL_FLASH_LATENCY_4WS
  *         @arg @ref LL_FLASH_LATENCY_5WS
  *         @arg @ref LL_FLASH_LATENCY_6WS
  *         @arg @ref LL_FLASH_LATENCY_7WS
  *         @arg @ref LL_FLASH_LATENCY_8WS
  *         @arg @ref LL_FLASH_LATENCY_9WS
  *         @arg @ref LL_FLASH_LATENCY_10WS
  *         @arg @ref LL_FLASH_LATENCY_11WS
  *         @arg @ref LL_FLASH_LATENCY_12WS
  *         @arg @ref LL_FLASH_LATENCY_13WS
  *         @arg @ref LL_FLASH_LATENCY_14WS
  *         @arg @ref LL_FLASH_LATENCY_15WS
  */
__STATIC_INLINE void LL_FLASH_SetLatency(FLASH_TypeDef *flashx, uint32_t latency)
{
  STM32_MODIFY_REG(flashx->ACR, FLASH_ACR_LATENCY, latency);
}

/**
  * @brief  Get Flash latency.
  * @rmtoll
  *  ACR           LATENCY           LL_FLASH_GetLatency
  * @param  flashx FLASH instance.
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_FLASH_LATENCY_0WS
  *         @arg @ref LL_FLASH_LATENCY_1WS
  *         @arg @ref LL_FLASH_LATENCY_2WS
  *         @arg @ref LL_FLASH_LATENCY_3WS
  *         @arg @ref LL_FLASH_LATENCY_4WS
  *         @arg @ref LL_FLASH_LATENCY_5WS
  *         @arg @ref LL_FLASH_LATENCY_6WS
  *         @arg @ref LL_FLASH_LATENCY_7WS
  *         @arg @ref LL_FLASH_LATENCY_8WS
  *         @arg @ref LL_FLASH_LATENCY_9WS
  *         @arg @ref LL_FLASH_LATENCY_10WS
  *         @arg @ref LL_FLASH_LATENCY_11WS
  *         @arg @ref LL_FLASH_LATENCY_12WS
  *         @arg @ref LL_FLASH_LATENCY_13WS
  *         @arg @ref LL_FLASH_LATENCY_14WS
  *         @arg @ref LL_FLASH_LATENCY_15WS
  */
__STATIC_INLINE uint32_t LL_FLASH_GetLatency(const FLASH_TypeDef *flashx)
{
  return (STM32_READ_BIT(flashx->ACR, FLASH_ACR_LATENCY));
}

/**
  * @brief  Set Flash programming delay.
  * @rmtoll
  *  ACR           WRHIGHFREQ           LL_FLASH_SetProgrammingDelay
  * @param  flashx FLASH instance.
  * @param  delay
  *         This parameter can be one of the following values:
  *         @arg @ref LL_FLASH_PROGRAM_DELAY_0
  *         @arg @ref LL_FLASH_PROGRAM_DELAY_1
  *         @arg @ref LL_FLASH_PROGRAM_DELAY_2
  *         @arg @ref LL_FLASH_PROGRAM_DELAY_3
  */
__STATIC_INLINE void LL_FLASH_SetProgrammingDelay(FLASH_TypeDef *flashx, uint32_t delay)
{
  STM32_MODIFY_REG(flashx->ACR, FLASH_ACR_WRHIGHFREQ, delay);
}

/**
  * @brief  Get Flash programming delay.
  * @rmtoll
  *  ACR           WRHIGHFREQ           LL_FLASH_GetProgrammingDelay
  * @param  flashx FLASH instance.
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_FLASH_PROGRAM_DELAY_0
  *         @arg @ref LL_FLASH_PROGRAM_DELAY_1
  *         @arg @ref LL_FLASH_PROGRAM_DELAY_2
  *         @arg @ref LL_FLASH_PROGRAM_DELAY_3
  */
__STATIC_INLINE uint32_t LL_FLASH_GetProgrammingDelay(const FLASH_TypeDef *flashx)
{
  return (STM32_READ_BIT(flashx->ACR, FLASH_ACR_WRHIGHFREQ));
}

/**
  * @brief  Enable flash prefetch.
  * @rmtoll
  *  ACR           PRFTEN           LL_FLASH_EnablePrefetch
  * @param  flashx FLASH instance.
  */
__STATIC_INLINE void LL_FLASH_EnablePrefetch(FLASH_TypeDef *flashx)
{
  STM32_SET_BIT(flashx->ACR, FLASH_ACR_PRFTEN);
}

/**
  * @brief  Disable flash prefetch.
  * @rmtoll
  *  ACR           PRFTEN           LL_FLASH_DisablePrefetch
  * @param  flashx FLASH instance.
  */
__STATIC_INLINE void LL_FLASH_DisablePrefetch(FLASH_TypeDef *flashx)
{
  STM32_CLEAR_BIT(flashx->ACR, FLASH_ACR_PRFTEN);
}

/**
  * @brief  Check if the flash prefetch is enabled or disabled.
  * @rmtoll
  *  ACR           PRFTEN           LL_FLASH_IsEnabledPrefetch
  * @param  flashx FLASH instance.
  * @retval State of flash prefetch (1 enabled / 0 disabled).
  */
__STATIC_INLINE uint32_t LL_FLASH_IsEnabledPrefetch(const FLASH_TypeDef *flashx)
{
  return ((STM32_READ_BIT(flashx->ACR, FLASH_ACR_PRFTEN) == (FLASH_ACR_PRFTEN)) ? 1UL : 0UL);
}


/**
  * @brief  Set Flash boot location empty status.
  * @rmtoll
  *  ACR           EMPTY           LL_FLASH_SetEmptyBootLocation
  * @param  flashx FLASH instance.
  * @param  empty_status
  *         This parameter can be one of the following values:
  *         @arg @ref LL_FLASH_BOOT_LOCATION_PROGRAMMED
  *         @arg @ref LL_FLASH_BOOT_LOCATION_EMPTY
  */
__STATIC_INLINE void LL_FLASH_SetEmptyBootLocation(FLASH_TypeDef *flashx, uint32_t empty_status)
{
  STM32_MODIFY_REG(flashx->ACR, FLASH_ACR_EMPTY, empty_status);
}

/**
  * @brief  Get Flash boot location empty status.
  * @rmtoll
  *  ACR           EMPTY           LL_FLASH_GetEmptyBootLocation
  * @param  flashx FLASH instance.
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_FLASH_BOOT_LOCATION_PROGRAMMED
  *         @arg @ref LL_FLASH_BOOT_LOCATION_EMPTY
  */
__STATIC_INLINE uint32_t LL_FLASH_GetEmptyBootLocation(const FLASH_TypeDef *flashx)
{
  return (STM32_READ_BIT(flashx->ACR, FLASH_ACR_EMPTY));
}

/**
  * @brief  Set the flash unlock key.
  * @rmtoll
  *  KEYR         KEY/SECKEY           LL_FLASH_SetUnlockKey
  * @param  flashx FLASH instance.
  * @param  key
  *         This parameter can be one of the following values:
  *         @arg @ref LL_FLASH_KEY1
  *         @arg @ref LL_FLASH_KEY2
  */
__STATIC_INLINE void LL_FLASH_SetUnlockKey(FLASH_TypeDef *flashx, uint32_t key)
{
  STM32_WRITE_REG(flashx->KEYR, key);
}

/**
  * @brief  Set the flash option bytes unlock key.
  * @rmtoll
  *  OPTKEYR           OPTKEY           LL_FLASH_OB_SetUnlockKey
  * @param  flashx FLASH instance.
  * @param  key
  *         This parameter can be one of the following values:
  *         @arg @ref LL_FLASH_OB_OPTKEY1
  *         @arg @ref LL_FLASH_OB_OPTKEY2
  */
__STATIC_INLINE void LL_FLASH_OB_SetUnlockKey(FLASH_TypeDef *flashx, uint32_t key)
{
  STM32_WRITE_REG(flashx->OPTKEYR, key);
}

/**
  * @brief  Read the state of selected operation status flags.
  * @rmtoll
  *  OPSR     DATA_OP|BK_OP|OTP_OP     LL_FLASH_ReadFlag_OP
  * @param  flashx FLASH instance.
  * @param  flags
  *         This parameter can one or a combination of the following values:
  *         @arg @ref LL_FLASH_FLAG_DATA_OP
  *         @arg @ref LL_FLASH_FLAG_BK_OP
  *         @arg @ref LL_FLASH_FLAG_OTP_OP
  *         @arg @ref LL_FLASH_FLAG_OP_AREA_ALL
  * @retval Returned value : state of selected operation status flags.
  */
__STATIC_INLINE uint32_t LL_FLASH_ReadFlag_OP(const FLASH_TypeDef *flashx, const uint32_t flags)
{
  return (STM32_READ_BIT(flashx->OPSR, flags));
}

/**
  * @brief  Get the flash interrupted operation data flash flag.
  * @rmtoll
  *  OPSR           DATA_OP           LL_FLASH_IsActiveFlag_DATA_OP
  * @param  flashx FLASH instance.
  * @retval State of interrupted operation data flash flag (1: interrupt from data flash / 0: not from data flash).
  */
__STATIC_INLINE uint32_t LL_FLASH_IsActiveFlag_DATA_OP(const FLASH_TypeDef *flashx)
{
  return (((STM32_READ_BIT(flashx->OPSR, FLASH_OPSR_DATA_OP)) == (FLASH_OPSR_DATA_OP)) ? 1UL : 0UL);
}

/**
  * @brief  Get the flash interrupted operation bank.
  * @rmtoll
  *  OPSR           BK_OP           LL_FLASH_IsActiveFlag_BK_OP
  * @param  flashx FLASH instance.
  * @retval Returned value : the flash interrupted operation bank (0: bank1 / 1: bank2).
  */
__STATIC_INLINE uint32_t LL_FLASH_IsActiveFlag_BK_OP(const FLASH_TypeDef *flashx)
{
  return (((STM32_READ_BIT(flashx->OPSR, FLASH_OPSR_BK_OP)) == (FLASH_OPSR_BK_OP)) ? 1UL : 0UL);
}

/**
  * @brief  Get the flash interrupted operation OTP flash flag.
  * @rmtoll
  *  OPSR           OTP_OP           LL_FLASH_IsActiveFlag_OTP_OP
  * @param  flashx FLASH instance.
  * @retval State of interrupted operation OTP flash flag (1: interrupt from OTP flash / 0: not from OTP flash).
  */
__STATIC_INLINE uint32_t LL_FLASH_IsActiveFlag_OTP_OP(const FLASH_TypeDef *flashx)
{
  return (((STM32_READ_BIT(flashx->OPSR, FLASH_OPSR_OTP_OP)) == (FLASH_OPSR_OTP_OP)) ? 1UL : 0UL);
}

/**
  * @brief  Get the flash interrupted operation address offset.
  * @rmtoll
  *  OPSR           ADDR_OP           LL_FLASH_GetOperInterruptedAddressOffset
  * @param  flashx FLASH instance.
  * @retval Returned value : the flash interrupted operation address offset.
  */
__STATIC_INLINE uint32_t LL_FLASH_GetOperInterruptedAddressOffset(const FLASH_TypeDef *flashx)
{
  return (STM32_READ_BIT(flashx->OPSR, FLASH_OPSR_ADDR_OP) >> FLASH_OPSR_ADDR_OP_Pos);
}

/**
  * @brief  Get the flash interrupted operation code.
  * @rmtoll
  *  OPSR           CODE_OP           LL_FLASH_GetOperInterruptedCode
  * @param  flashx FLASH instance.
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_FLASH_INTERRUPTED_NO_OPERATION
  *         @arg @ref LL_FLASH_INTERRUPTED_SINGLE_WRITE
  *         @arg @ref LL_FLASH_INTERRUPTED_PAGE_ERASE
  *         @arg @ref LL_FLASH_INTERRUPTED_BANK_ERASE
  *         @arg @ref LL_FLASH_INTERRUPTED_MASS_ERASE
  *         @arg @ref LL_FLASH_INTERRUPTED_OB_CHANGE
  */
__STATIC_INLINE uint32_t LL_FLASH_GetOperInterruptedCode(const FLASH_TypeDef *flashx)
{
  return (STM32_READ_BIT(flashx->OPSR, FLASH_OPSR_CODE_OP));
}

/**
  * @brief  Lock the flash option bytes control access registers.
  * @rmtoll
  *  OPTCR           OPTLOCK           LL_FLASH_OB_Lock
  * @param  flashx FLASH instance.
  */
__STATIC_INLINE void LL_FLASH_OB_Lock(FLASH_TypeDef *flashx)
{
  STM32_SET_BIT(flashx->OPTCR, FLASH_OPTCR_OPTLOCK);
}

/**
  * @brief  Check the flash option bytes control access registers lock state.
  * @rmtoll
  *  OPTCR           OPTLOCK           LL_FLASH_OB_IsLocked
  * @param  flashx FLASH instance.
  * @retval State of flash option bytes lock (1 locked / 0 unlocked).
  */
__STATIC_INLINE uint32_t LL_FLASH_OB_IsLocked(const FLASH_TypeDef *flashx)
{
  return ((STM32_READ_BIT(flashx->OPTCR, FLASH_OPTCR_OPTLOCK) == (FLASH_OPTCR_OPTLOCK)) ? 1UL : 0UL);
}

/**
  * @brief  Start the flash option bytes modification.
  * @rmtoll
  *  OPTCR           OPTSTRT           LL_FLASH_OB_StartModification
  * @param  flashx FLASH instance.
  */
__STATIC_INLINE void LL_FLASH_OB_StartModification(FLASH_TypeDef *flashx)
{
  STM32_SET_BIT(flashx->OPTCR, FLASH_OPTCR_OPTSTRT);
}

/**
  * @brief  Check the flash option bytes control access registers bank swap state.
  * @rmtoll
  *  OPTCR           SWAP_BANK           LL_FLASH_OB_IsBankSwapped
  * @param  flashx FLASH instance.
  * @retval State of flash option bytes bank swap (1 swapped / 0 not swapped).
  */
__STATIC_INLINE uint32_t LL_FLASH_OB_IsBankSwapped(const FLASH_TypeDef *flashx)
{
  return ((STM32_READ_BIT(flashx->OPTCR, FLASH_OPTCR_SWAP_BANK) == (FLASH_OPTCR_SWAP_BANK)) ? 1UL : 0UL);
}

/**
  * @}
  */

/** @defgroup FLASH_LL_EF_FLAG_Management LL FLASH Flag Management
  * @{
  */

/**
  * @brief  Check if any of the selected flag is active.
  * @rmtoll
  *  SR       BSY|WBNE|DBNE     LL_FLASH_IsActiveFlag
  * @param  flashx FLASH instance.
  * @param  flags
  *         This parameter can be one or a combination of the following values:
  *         @arg @ref LL_FLASH_FLAG_BSY
  *         @arg @ref LL_FLASH_FLAG_WBNE
  *         @arg @ref LL_FLASH_FLAG_DBNE
  *         @arg @ref LL_FLASH_FLAG_STATUS_ALL
  *         @arg @ref LL_FLASH_FLAG_EOP
  *         @arg @ref LL_FLASH_FLAG_WRPERR
  *         @arg @ref LL_FLASH_FLAG_PGSERR
  *         @arg @ref LL_FLASH_FLAG_STRBERR
  *         @arg @ref LL_FLASH_FLAG_INCERR
  *         @arg @ref LL_FLASH_FLAG_OPTCHANGEERR
  *         @arg @ref LL_FLASH_FLAG_ERRORS_ALL
  * @retval State of selected flag (1 if at least one is active / 0 if none of the selected flags are active).
  */
__STATIC_INLINE uint32_t LL_FLASH_IsActiveFlag(const FLASH_TypeDef *flashx, uint32_t flags)
{
  return ((STM32_READ_BIT(flashx->SR, flags) != 0U) ? 1UL : 0UL);
}

/**
  * @brief  Read the state of selected flash operation error flag.
  * @rmtoll
  *  SR      EOP/WRPERR/PGSERR/STRBERR/INCERR/OPTCHANGEERR      LL_FLASH_ReadFlag
  * @param  flashx FLASH instance.
  * @param  flags
  *         This parameter can be one or a combination of the following values:
  *         @arg @ref LL_FLASH_FLAG_BSY
  *         @arg @ref LL_FLASH_FLAG_WBNE
  *         @arg @ref LL_FLASH_FLAG_DBNE
  *         @arg @ref LL_FLASH_FLAG_STATUS_ALL
  *         @arg @ref LL_FLASH_FLAG_EOP
  *         @arg @ref LL_FLASH_FLAG_WRPERR
  *         @arg @ref LL_FLASH_FLAG_PGSERR
  *         @arg @ref LL_FLASH_FLAG_STRBERR
  *         @arg @ref LL_FLASH_FLAG_INCERR
  *         @arg @ref LL_FLASH_FLAG_OPTCHANGEERR
  *         @arg @ref LL_FLASH_FLAG_ERRORS_ALL
  * @retval State of selected flags (1 active / 0 not active).
  */
__STATIC_INLINE uint32_t LL_FLASH_ReadFlag(const FLASH_TypeDef *flashx, uint32_t flags)
{
  return (STM32_READ_BIT(flashx->SR, flags));
}

/**
  * @brief  Clear the flash operation error flag.
  * @rmtoll
  *  SR      EOP/WRPERR/PGSERR/STRBERR/INCERR/OPTCHANGEERR      LL_FLASH_ClearFlag
  * @param  flashx FLASH instance.
  * @param  flags
  *         This parameter can be one or a combination of the following values:
  *         @arg @ref LL_FLASH_FLAG_EOP
  *         @arg @ref LL_FLASH_FLAG_WRPERR
  *         @arg @ref LL_FLASH_FLAG_PGSERR
  *         @arg @ref LL_FLASH_FLAG_STRBERR
  *         @arg @ref LL_FLASH_FLAG_INCERR
  *         @arg @ref LL_FLASH_FLAG_OPTCHANGEERR
  *         @arg @ref LL_FLASH_FLAG_ERRORS_ALL
  */
__STATIC_INLINE void LL_FLASH_ClearFlag(FLASH_TypeDef *flashx, uint32_t flags)
{
  STM32_SET_BIT(flashx->CCR, flags);
}

/**
  * @brief  Check if the flash busy flag is active.
  * @rmtoll
  *  SR           BSY           LL_FLASH_IsActiveFlag_BSY
  * @param  flashx FLASH instance.
  * @retval State of BSY flag (1 active / 0 not active).
  */
__STATIC_INLINE uint32_t LL_FLASH_IsActiveFlag_BSY(const FLASH_TypeDef *flashx)
{
  return ((STM32_READ_BIT(flashx->SR, FLASH_SR_BSY) == (FLASH_SR_BSY)) ? 1UL : 0UL);
}

/**
  * @brief  Check if the write buffer not empty flag is active.
  * @rmtoll
  *  SR           WBNE           LL_FLASH_IsActiveFlag_WBNE
  * @param  flashx FLASH instance.
  * @retval State of WBNE flag (1 active (waiting for data to complete) / 0 not active (buffer empty or full)).
  */
__STATIC_INLINE uint32_t LL_FLASH_IsActiveFlag_WBNE(const FLASH_TypeDef *flashx)
{
  return ((STM32_READ_BIT(flashx->SR, FLASH_SR_WBNE) == (FLASH_SR_WBNE)) ? 1UL : 0UL);
}

/**
  * @brief  Check if the data buffer not empty flag is active.
  * @rmtoll
  *  SR           DBNE           LL_FLASH_IsActiveFlag_DBNE
  * @param  flashx FLASH instance.
  * @retval State of DBNE flag (1 active (data buffer used, waiting) / 0 not active (buffer not used)).
  */
__STATIC_INLINE uint32_t LL_FLASH_IsActiveFlag_DBNE(const FLASH_TypeDef *flashx)
{
  return ((STM32_READ_BIT(flashx->SR, FLASH_SR_DBNE) == (FLASH_SR_DBNE)) ? 1UL : 0UL);
}

/**
  * @brief  Check if the OEM key lock mechanism is active.
  * @rmtoll
  *  SR           OEMLOCK           LL_FLASH_IsActiveFlag_OEMLOCK
  * @param  flashx FLASH instance.
  * @retval State of OEMLOCK flag (1: OEM key locked / 0: OEM key is virgin).
  */
__STATIC_INLINE uint32_t LL_FLASH_IsActiveFlag_OEMLOCK(const FLASH_TypeDef *flashx)
{
  return ((STM32_READ_BIT(flashx->SR, FLASH_SR_OEMLOCK) == (FLASH_SR_OEMLOCK)) ? 1UL : 0UL);
}

/**
  * @brief  Check if the BS key lock mechanism is active.
  * @rmtoll
  *  SR           BSLOCK           LL_FLASH_IsActiveFlag_BSLOCK
  * @param  flashx FLASH instance.
  * @retval State of BSLOCK flag (1: BS key locked / 0: BS key is default).
  */
__STATIC_INLINE uint32_t LL_FLASH_IsActiveFlag_BSLOCK(const FLASH_TypeDef *flashx)
{
  return ((STM32_READ_BIT(flashx->SR, FLASH_SR_BSLOCK) == (FLASH_SR_BSLOCK)) ? 1UL : 0UL);
}

/**
  * @brief  Check if the flash end of operation flag is active.
  * @rmtoll
  *  SR           EOP           LL_FLASH_IsActiveFlag_EOP
  * @param  flashx FLASH instance.
  * @retval State of EOP flag (1 active / 0 not active).
  */
__STATIC_INLINE uint32_t LL_FLASH_IsActiveFlag_EOP(const FLASH_TypeDef *flashx)
{
  return ((STM32_READ_BIT(flashx->SR, FLASH_SR_EOP) == (FLASH_SR_EOP)) ? 1UL : 0UL);
}

/**
  * @brief  Clear the flash end of operation error flag.
  * @rmtoll
  *  CCR        CLR_EOP           LL_FLASH_ClearFlag_EOP
  * @param  flashx FLASH instance.
  */
__STATIC_INLINE void LL_FLASH_ClearFlag_EOP(FLASH_TypeDef *flashx)
{
  STM32_SET_BIT(flashx->CCR, FLASH_CCR_CLR_EOP);
}

/**
  * @brief  Check if the flash write protection error flag is active.
  * @rmtoll
  *  SR           WRPERR           LL_FLASH_IsActiveFlag_WRPERR
  * @param  flashx FLASH instance.
  * @retval State of WRPERR flag (1 active / 0 not active).
  */
__STATIC_INLINE uint32_t LL_FLASH_IsActiveFlag_WRPERR(const FLASH_TypeDef *flashx)
{
  return ((STM32_READ_BIT(flashx->SR, FLASH_SR_WRPERR) == (FLASH_SR_WRPERR)) ? 1UL : 0UL);
}

/**
  * @brief  Clear the flash write protection error flag.
  * @rmtoll
  *  CCR        CLR_WRPERR           LL_FLASH_ClearFlag_WRPERR
  * @param  flashx FLASH instance.
  */
__STATIC_INLINE void LL_FLASH_ClearFlag_WRPERR(FLASH_TypeDef *flashx)
{
  STM32_SET_BIT(flashx->CCR, FLASH_CCR_CLR_WRPERR);
}

/**
  * @brief  Check if the flash programming sequence error flag is active.
  * @rmtoll
  *  SR           PGSERR           LL_FLASH_IsActiveFlag_PGSERR
  * @param  flashx FLASH instance.
  * @retval State of PGSERR flag (1 active / 0 not active).
  */
__STATIC_INLINE uint32_t LL_FLASH_IsActiveFlag_PGSERR(const FLASH_TypeDef *flashx)
{
  return ((STM32_READ_BIT(flashx->SR, FLASH_SR_PGSERR) == (FLASH_SR_PGSERR)) ? 1UL : 0UL);
}

/**
  * @brief  Clear the flash programming sequence error flag.
  * @rmtoll
  *  CCR        CLR_PGSERR           LL_FLASH_ClearFlag_PGSERR
  * @param  flashx FLASH instance.
  */
__STATIC_INLINE void LL_FLASH_ClearFlag_PGSERR(FLASH_TypeDef *flashx)
{
  STM32_SET_BIT(flashx->CCR, FLASH_CCR_CLR_PGSERR);
}

/**
  * @brief  Check if the flash strobe error flag is active.
  * @rmtoll
  *  SR           STRBERR           LL_FLASH_IsActiveFlag_STRBERR
  * @param  flashx FLASH instance.
  * @retval State of STRBERR flag (1 active / 0 not active).
  */
__STATIC_INLINE uint32_t LL_FLASH_IsActiveFlag_STRBERR(const FLASH_TypeDef *flashx)
{
  return ((STM32_READ_BIT(flashx->SR, FLASH_SR_STRBERR) == (FLASH_SR_STRBERR)) ? 1UL : 0UL);
}

/**
  * @brief  Clear the flash strobe error flag.
  * @rmtoll
  *  CCR        CLR_STRBERR           LL_FLASH_ClearFlag_STRBERR
  * @param  flashx FLASH instance.
  */
__STATIC_INLINE void LL_FLASH_ClearFlag_STRBERR(FLASH_TypeDef *flashx)
{
  STM32_SET_BIT(flashx->CCR, FLASH_CCR_CLR_STRBERR);
}

/**
  * @brief  Check if the flash inconsistency error flag is active.
  * @rmtoll
  *  SR           INCERR           LL_FLASH_IsActiveFlag_INCERR
  * @param  flashx FLASH instance.
  * @retval State of INCERR flag (1 active / 0 not active).
  */
__STATIC_INLINE uint32_t LL_FLASH_IsActiveFlag_INCERR(const FLASH_TypeDef *flashx)
{
  return ((STM32_READ_BIT(flashx->SR, FLASH_SR_INCERR) == (FLASH_SR_INCERR)) ? 1UL : 0UL);
}

