MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/ll/stm32c5xx_ll_flash.h
/**
  * @brief  Clear the flash inconsistency error flag.
  * @rmtoll
  *  CCR        CLR_INCERR           LL_FLASH_ClearFlag_INCERR
  * @param  flashx FLASH instance.
  */
__STATIC_INLINE void LL_FLASH_ClearFlag_INCERR(FLASH_TypeDef *flashx)
{
  STM32_SET_BIT(flashx->CCR, FLASH_CCR_CLR_INCERR);
}
/**
  * @brief  Check if the flash option-byte change error flag is active.
  * @rmtoll
  *  SR           OPTCHANGEERR           LL_FLASH_IsActiveFlag_OPTCHANGEERR
  * @param  flashx FLASH instance.
  * @retval State of OPTCHANGEERR flag (1 active / 0 not active).
  */
__STATIC_INLINE uint32_t LL_FLASH_IsActiveFlag_OPTCHANGEERR(const FLASH_TypeDef *flashx)
{
  return ((STM32_READ_BIT(flashx->SR, FLASH_SR_OPTCHANGEERR) == (FLASH_SR_OPTCHANGEERR)) ? 1UL : 0UL);
}

/**
  * @brief  Clear the flash option-byte change error flag.
  * @rmtoll
  *  CCR        CLR_OPTCHANGEERR           LL_FLASH_ClearFlag_OPTCHANGEERR
  * @param  flashx FLASH instance.
  */
__STATIC_INLINE void LL_FLASH_ClearFlag_OPTCHANGEERR(FLASH_TypeDef *flashx)
{
  STM32_SET_BIT(flashx->CCR, FLASH_CCR_CLR_OPTCHANGEERR);
}

/**
  * @}
  */

/** @defgroup FLASH_LL_EF_Control LL FLASH Operation and Control Functions
  * @{
  */

/**
  * @brief  Lock the flash control assess registers.
  * @rmtoll
  *  CR           LOCK           LL_FLASH_Lock
  * @param  flashx FLASH instance.
  */
__STATIC_INLINE void LL_FLASH_Lock(FLASH_TypeDef *flashx)
{
  STM32_SET_BIT(flashx->CR, FLASH_CR_LOCK);
}

/**
  * @brief  Check the flash control access registers lock state.
  * @rmtoll
  *  CR           LOCK           LL_FLASH_IsLocked
  * @param  flashx FLASH instance.
  * @retval State of flash lock (1 locked / 0 unlocked).
  */
__STATIC_INLINE uint32_t LL_FLASH_IsLocked(const FLASH_TypeDef *flashx)
{
  return ((STM32_READ_BIT(flashx->CR, FLASH_CR_LOCK) == (FLASH_CR_LOCK)) ? 1UL : 0UL);
}

/**
  * @brief  Enable the flash programming.
  * @rmtoll
  *  CR           PG           LL_FLASH_EnableProgramming
  * @param  flashx FLASH instance.
  */
__STATIC_INLINE void LL_FLASH_EnableProgramming(FLASH_TypeDef *flashx)
{
  STM32_SET_BIT(flashx->CR, FLASH_CR_PG);
}

/**
  * @brief  Disable the flash programming.
  * @rmtoll
  *  CR           PG           LL_FLASH_DisableProgramming
  * @param  flashx FLASH instance.
  */
__STATIC_INLINE void LL_FLASH_DisableProgramming(FLASH_TypeDef *flashx)
{
  STM32_CLEAR_BIT(flashx->CR, FLASH_CR_PG);
}

/**
  * @brief  Check if the flash programming is enabled or disabled.
  * @rmtoll
  *  CR           PG           LL_FLASH_IsEnabledProgramming
  * @param  flashx FLASH instance.
  * @retval State of flash programming (1 enabled / 0 disabled).
  */
__STATIC_INLINE uint32_t LL_FLASH_IsEnabledProgramming(const FLASH_TypeDef *flashx)
{
  return ((STM32_READ_BIT(flashx->CR, FLASH_CR_PG) == (FLASH_CR_PG)) ? 1UL : 0UL);
}

/**
  * @brief  Enable the flash page erase.
  * @rmtoll
  *  CR           PER           LL_FLASH_EnablePageErase
  * @param  flashx FLASH instance.
  */
__STATIC_INLINE void LL_FLASH_EnablePageErase(FLASH_TypeDef *flashx)
{
  STM32_SET_BIT(flashx->CR, FLASH_CR_PER);
}

/**
  * @brief  Disable the flash page erase.
  * @rmtoll
  *  CR           PER           LL_FLASH_DisablePageErase
  * @param  flashx FLASH instance.
  */
__STATIC_INLINE void LL_FLASH_DisablePageErase(FLASH_TypeDef *flashx)
{
  STM32_CLEAR_BIT(flashx->CR, FLASH_CR_PER);
}

/**
  * @brief  Check if the flash page erase is enabled or disabled.
  * @rmtoll
  *  CR           PER           LL_FLASH_IsEnabledPageErase
  * @param  flashx FLASH instance.
  * @retval State of flash page erase (1 enabled / 0 disabled).
  */
__STATIC_INLINE uint32_t LL_FLASH_IsEnabledPageErase(const FLASH_TypeDef *flashx)
{
  return ((STM32_READ_BIT(flashx->CR, FLASH_CR_PER) == (FLASH_CR_PER)) ? 1UL : 0UL);
}

/**
  * @brief  Enable the flash bank erase.
  * @rmtoll
  *  CR        BKSEL/BER           LL_FLASH_EnableBankErase
  * @param  flashx FLASH instance.
  * @param  bank
  *         This parameter can be one of the following values :
  *         @arg @ref LL_FLASH_ERASE_BANK_1
  *         @arg @ref LL_FLASH_ERASE_BANK_2
  */
__STATIC_INLINE void LL_FLASH_EnableBankErase(FLASH_TypeDef *flashx, uint32_t bank)
{
  STM32_MODIFY_REG(flashx->CR, (FLASH_CR_BKSEL | FLASH_CR_BER), (bank | FLASH_CR_BER));
}

/**
  * @brief  Disable the flash bank erase.
  * @rmtoll
  *  CR           BKSEL/BER           LL_FLASH_DisableBankErase
  * @param  flashx FLASH instance.
  * @param  bank
  *         This parameter can be one of the following values :
  *         @arg @ref LL_FLASH_ERASE_BANK_1
  *         @arg @ref LL_FLASH_ERASE_BANK_2
  */
__STATIC_INLINE void LL_FLASH_DisableBankErase(FLASH_TypeDef *flashx, uint32_t bank)
{
  STM32_CLEAR_BIT(flashx->CR, (bank | FLASH_CR_BER));
}

/**
  * @brief  Check if the flash bank erase is enabled or disabled.
  * @rmtoll
  *  CR           BKSEL/BER           LL_FLASH_IsEnabledBankErase
  * @param  flashx FLASH instance.
  * @param  bank
  *         This parameter can be one of the following values :
  *         @arg @ref LL_FLASH_ERASE_BANK_1
  *         @arg @ref LL_FLASH_ERASE_BANK_2
  * @retval State of flash mass erase (1 enabled / 0 disabled).
  */
__STATIC_INLINE uint32_t LL_FLASH_IsEnabledBankErase(const FLASH_TypeDef *flashx, const uint32_t bank)
{
  return ((STM32_READ_BIT(flashx->CR, (FLASH_CR_BKSEL | FLASH_CR_BER)) == (bank | FLASH_CR_BER)) ? 1UL : 0UL);
}

/**
  * @brief  Enable the flash mass erase.
  * @rmtoll
  *  CR        MER           LL_FLASH_EnableMassErase
  * @param  flashx FLASH instance.
  */
__STATIC_INLINE void LL_FLASH_EnableMassErase(FLASH_TypeDef *flashx)
{
  STM32_SET_BIT(flashx->CR, FLASH_CR_MER);
}

/**
  * @brief  Disable the flash mass erase.
  * @rmtoll
  *  CR        MER           LL_FLASH_DisableMassErase
  * @param  flashx FLASH instance.
  */
__STATIC_INLINE void LL_FLASH_DisableMassErase(FLASH_TypeDef *flashx)
{
  STM32_CLEAR_BIT(flashx->CR, FLASH_CR_MER);
}

/**
  * @brief  Check if the flash mass erase is enabled or disabled.
  * @rmtoll
  *  CR           MER           LL_FLASH_IsEnabledMassErase
  * @param  flashx FLASH instance.
  * @retval State of flash mass erase (1 enabled / 0 disabled).
  */
__STATIC_INLINE uint32_t LL_FLASH_IsEnabledMassErase(const FLASH_TypeDef *flashx)
{
  return ((STM32_READ_BIT(flashx->CR, FLASH_CR_MER) == (FLASH_CR_MER)) ? 1UL : 0UL);
}

/**
  * @brief  Disable all flash operation.
  * @rmtoll
  *  NSCR/SECCR           PG/PER/MER1/MER2           LL_FLASH_DisableAllOperation
  * @param  flashx FLASH instance.
  */
__STATIC_INLINE void LL_FLASH_DisableAllOperation(FLASH_TypeDef *flashx)
{
  STM32_CLEAR_BIT(flashx->CR, FLASH_CR_PER | FLASH_CR_BER | FLASH_CR_MER | FLASH_CR_PG);
}


/**
  * @brief  Enable the flash force-write operation.
  * @rmtoll
  *  CR           FW           LL_FLASH_EnableForceWrite
  * @param  flashx FLASH instance.
  */
__STATIC_INLINE void LL_FLASH_EnableForceWrite(FLASH_TypeDef *flashx)
{
  STM32_SET_BIT(flashx->CR, FLASH_CR_FW);
}

/**
  * @brief  Start the flash erase operation.
  * @rmtoll
  *  CR           STRT           LL_FLASH_StartEraseOperation
  * @param  flashx FLASH instance.
  */
__STATIC_INLINE void LL_FLASH_StartEraseOperation(FLASH_TypeDef *flashx)
{
  STM32_SET_BIT(flashx->CR, FLASH_CR_STRT);
}


/**
  * @brief  Set the flash page erase index.
  * @rmtoll
  *  CR           BKSEL/EDATASEL/PNB           LL_FLASH_SetPageEraseIndex
  * @param  flashx FLASH instance.
  * @param  bank
  *         This parameter can be one of the following values :
  *         @arg @ref LL_FLASH_ERASE_BANK_1
  *         @arg @ref LL_FLASH_ERASE_BANK_2
  * @param  area
  *         This parameter can be one of the following values :
  *         @arg @ref LL_FLASH_ERASE_USER_AREA
  *         @arg @ref LL_FLASH_ERASE_EDATA_AREA
  * @param  page This parameter can take any value in [0:31]
  */
__STATIC_INLINE void LL_FLASH_SetPageEraseIndex(FLASH_TypeDef *flashx, uint32_t bank, uint32_t area, uint32_t page)
{
  STM32_MODIFY_REG(flashx->CR, (FLASH_CR_BKSEL | FLASH_CR_EDATASEL | FLASH_CR_PNB), \
                   (bank | area | (page << FLASH_CR_PNB_Pos)));
}

/**
  * @brief  Start the flash erase page.
  * @rmtoll
  *  CR           BKER/EDATASEL/PNB/PER/STRT           LL_FLASH_StartErasePage
  * @param  flashx FLASH instance.
  * @param  bank
  *         This parameter can be one of the following values :
  *         @arg @ref LL_FLASH_ERASE_BANK_1
  *         @arg @ref LL_FLASH_ERASE_BANK_2
  * @param  area
  *         This parameter can be one of the following values :
  *         @arg @ref LL_FLASH_ERASE_USER_AREA
  *         @arg @ref LL_FLASH_ERASE_EDATA_AREA
  * @param  page This parameter can take any value in [0:31]
  */
__STATIC_INLINE void LL_FLASH_StartErasePage(FLASH_TypeDef *flashx, uint32_t bank, uint32_t area, uint32_t page)
{
  STM32_MODIFY_REG(flashx->CR, (FLASH_CR_BKSEL | FLASH_CR_EDATASEL | FLASH_CR_PNB | FLASH_CR_STRT | FLASH_CR_PER), \
                   (bank | area | (page << FLASH_CR_PNB_Pos) | FLASH_CR_STRT | FLASH_CR_PER));
}

/**
  * @brief  Start the flash erase bank.
  * @rmtoll
  *  CR           BKSEL/STRT/BER           LL_FLASH_StartEraseBank
  * @param  flashx FLASH instance.
  * @param  bank
  *         This parameter can be one of the following values :
  *         @arg @ref LL_FLASH_ERASE_BANK_1
  *         @arg @ref LL_FLASH_ERASE_BANK_2
  */
__STATIC_INLINE void LL_FLASH_StartEraseBank(FLASH_TypeDef *flashx, uint32_t bank)
{
  STM32_MODIFY_REG(flashx->CR, (FLASH_CR_BKSEL | FLASH_CR_BER | FLASH_CR_STRT), (bank | FLASH_CR_BER | FLASH_CR_STRT));
}

/**
  * @brief  Start the flash erase bank.
  * @rmtoll
  *  CR           BER/STRT           LL_FLASH_StartMassErase
  * @param  flashx FLASH instance.
  */
__STATIC_INLINE void LL_FLASH_StartMassErase(FLASH_TypeDef *flashx)
{
  STM32_SET_BIT(flashx->CR, (FLASH_CR_MER | FLASH_CR_STRT));
}

/**
  * @brief  Enable the flash interrupt.
  * @rmtoll
  *  CR          EOPIE/WRPERRIE/PGSERRIE/STRBERRIE/INCERRIE/OPTCHANGEERRIE     LL_FLASH_EnableIT
  * @param  flashx FLASH instance.
  * @param  interrupt
  *         This parameter can be a combination of the following values:
  *         @arg @ref LL_FLASH_IT_EOP
  *         @arg @ref LL_FLASH_IT_WRPERR
  *         @arg @ref LL_FLASH_IT_PGSERR
  *         @arg @ref LL_FLASH_IT_STRBERR
  *         @arg @ref LL_FLASH_IT_INCERR
  *         @arg @ref LL_FLASH_IT_OPTCHANGEERR
  *         @arg @ref LL_FLASH_IT_ERRORS_ALL
  *         @arg @ref LL_FLASH_IT_ALL
  */
__STATIC_INLINE void LL_FLASH_EnableIT(FLASH_TypeDef *flashx, uint32_t interrupt)
{
  STM32_SET_BIT(flashx->CR, interrupt);
}

/**
  * @brief  Disable the flash interrupt.
  * @rmtoll
  *  CR          EOPIE/WRPERRIE/PGSERRIE/STRBERRIE/INCERRIE/OPTCHANGEERRIE    LL_FLASH_DisableIT
  * @param  flashx FLASH instance.
  * @param  interrupt
  *         This parameter can be a combination of the following values:
  *         @arg @ref LL_FLASH_IT_EOP
  *         @arg @ref LL_FLASH_IT_WRPERR
  *         @arg @ref LL_FLASH_IT_PGSERR
  *         @arg @ref LL_FLASH_IT_STRBERR
  *         @arg @ref LL_FLASH_IT_INCERR
  *         @arg @ref LL_FLASH_IT_OPTCHANGEERR
  *         @arg @ref LL_FLASH_IT_ERRORS_ALL
  *         @arg @ref LL_FLASH_IT_ALL
  */
__STATIC_INLINE void LL_FLASH_DisableIT(FLASH_TypeDef *flashx, uint32_t interrupt)
{
  STM32_CLEAR_BIT(flashx->CR, interrupt);
}

/**
  * @brief  Enable the flash end of operation interrupt.
  * @rmtoll
  *  CR          EOPIE        LL_FLASH_EnableIT_EOP
  * @param  flashx FLASH instance.
  */
__STATIC_INLINE void LL_FLASH_EnableIT_EOP(FLASH_TypeDef *flashx)
{
  STM32_SET_BIT(flashx->CR, FLASH_CR_EOPIE);
}

/**
  * @brief  Disable the flash end of operation interrupt.
  * @rmtoll
  *  CR          EOPIE        LL_FLASH_DisableIT_EOP
  * @param  flashx FLASH instance.
  */
__STATIC_INLINE void LL_FLASH_DisableIT_EOP(FLASH_TypeDef *flashx)
{
  STM32_CLEAR_BIT(flashx->CR, FLASH_CR_EOPIE);
}

/**
  * @brief  Check if the flash end of operation interrupt is enabled or disabled.
  * @rmtoll
  *  CR          EOPIE        LL_FLASH_IsEnabledIT_EOP
  * @param  flashx FLASH instance.
  * @retval State of flash EOP interruption (1 enabled / 0 disabled).
  */
__STATIC_INLINE uint32_t LL_FLASH_IsEnabledIT_EOP(const FLASH_TypeDef *flashx)
{
  return ((STM32_READ_BIT(flashx->CR, FLASH_CR_EOPIE) == (FLASH_CR_EOPIE)) ? 1UL : 0UL);
}

/**
  * @brief  Enable the flash write protection error interrupt.
  * @rmtoll
  *  CR          WRPERRIE        LL_FLASH_EnableIT_WRPERR
  * @param  flashx FLASH instance.
  */
__STATIC_INLINE void LL_FLASH_EnableIT_WRPERR(FLASH_TypeDef *flashx)
{
  STM32_SET_BIT(flashx->CR, FLASH_CR_WRPERRIE);
}

/**
  * @brief  Disable the flash write protection error interrupt.
  * @rmtoll
  *  CR          WRPERRIE        LL_FLASH_DisableIT_WRPERR
  * @param  flashx FLASH instance.
  */
__STATIC_INLINE void LL_FLASH_DisableIT_WRPERR(FLASH_TypeDef *flashx)
{
  STM32_CLEAR_BIT(flashx->CR, FLASH_CR_WRPERRIE);
}

/**
  * @brief  Check if the flash write protection error interrupt is enabled or disabled.
  * @rmtoll
  *  CR          WRPERRIE        LL_FLASH_IsEnabledIT_WRPERR
  * @param  flashx FLASH instance.
  * @retval State of flash WRPERR interruption (1 enabled / 0 disabled).
  */
__STATIC_INLINE uint32_t LL_FLASH_IsEnabledIT_WRPERR(const FLASH_TypeDef *flashx)
{
  return ((STM32_READ_BIT(flashx->CR, FLASH_CR_WRPERRIE) == (FLASH_CR_WRPERRIE)) ? 1UL : 0UL);
}

/**
  * @brief  Enable the flash programming sequence error interrupt.
  * @rmtoll
  *  CR          PGSERRIE        LL_FLASH_EnableIT_PGSERR
  * @param  flashx FLASH instance.
  */
__STATIC_INLINE void LL_FLASH_EnableIT_PGSERR(FLASH_TypeDef *flashx)
{
  STM32_SET_BIT(flashx->CR, FLASH_CR_PGSERRIE);
}

/**
  * @brief  Disable the flash programming sequence error interrupt.
  * @rmtoll
  *  CR          PGSERRIE        LL_FLASH_DisableIT_PGSERR
  * @param  flashx FLASH instance.
  */
__STATIC_INLINE void LL_FLASH_DisableIT_PGSERR(FLASH_TypeDef *flashx)
{
  STM32_CLEAR_BIT(flashx->CR, FLASH_CR_PGSERRIE);
}

/**
  * @brief  Check if the flash programming sequence error interrupt is enabled or disabled.
  * @rmtoll
  *  CR          PGSERRIE        LL_FLASH_IsEnabledIT_PGSERR
  * @param  flashx FLASH instance.
  * @retval State of flash PGSERR interruption (1 enabled / 0 disabled).
  */
__STATIC_INLINE uint32_t LL_FLASH_IsEnabledIT_PGSERR(const FLASH_TypeDef *flashx)
{
  return ((STM32_READ_BIT(flashx->CR, FLASH_CR_PGSERRIE) == (FLASH_CR_PGSERRIE)) ? 1UL : 0UL);
}

/**
  * @brief  Enable the flash strobe error interrupt.
  * @rmtoll
  *  CR          STRBERRIE        LL_FLASH_EnableIT_STRBERR
  * @param  flashx FLASH instance.
  */
__STATIC_INLINE void LL_FLASH_EnableIT_STRBERR(FLASH_TypeDef *flashx)
{
  STM32_SET_BIT(flashx->CR, FLASH_CR_STRBERRIE);
}

/**
  * @brief  Disable the flash strobe error interrupt.
  * @rmtoll
  *  CR          STRBERRIE        LL_FLASH_DisableIT_STRBERR
  * @param  flashx FLASH instance.
  */
__STATIC_INLINE void LL_FLASH_DisableIT_STRBERR(FLASH_TypeDef *flashx)
{
  STM32_CLEAR_BIT(flashx->CR, FLASH_CR_STRBERRIE);
}

/**
  * @brief  Check if the flash strobe error interrupt is enabled or disabled.
  * @rmtoll
  *  CR          STRBERRIE        LL_FLASH_IsEnabledIT_STRBERR
  * @param  flashx FLASH instance.
  * @retval State of flash STRBERR interruption (1 enabled / 0 disabled).
  */
__STATIC_INLINE uint32_t LL_FLASH_IsEnabledIT_STRBERR(const FLASH_TypeDef *flashx)
{
  return ((STM32_READ_BIT(flashx->CR, FLASH_CR_STRBERRIE) == (FLASH_CR_STRBERRIE)) ? 1UL : 0UL);
}

/**
  * @brief  Enable the flash inconsistency error interrupt.
  * @rmtoll
  *  CR          INCERRIE        LL_FLASH_EnableIT_INCERR
  * @param  flashx FLASH instance.
  */
__STATIC_INLINE void LL_FLASH_EnableIT_INCERR(FLASH_TypeDef *flashx)
{
  STM32_SET_BIT(flashx->CR, FLASH_CR_INCERRIE);
}

/**
  * @brief  Disable the flash inconsistency error interrupt.
  * @rmtoll
  *  CR          INCERRIE        LL_FLASH_DisableIT_INCERR
  * @param  flashx FLASH instance.
  */
__STATIC_INLINE void LL_FLASH_DisableIT_INCERR(FLASH_TypeDef *flashx)
{
  STM32_CLEAR_BIT(flashx->CR, FLASH_CR_INCERRIE);
}

/**
  * @brief  Check if the flash inconsistency error interrupt is enabled or disabled.
  * @rmtoll
  *  CR          INCERRIE        LL_FLASH_IsEnabledIT_INCERR
  * @param  flashx FLASH instance.
  * @retval State of flash INCERR interruption (1 enabled / 0 disabled).
  */
__STATIC_INLINE uint32_t LL_FLASH_IsEnabledIT_INCERR(const FLASH_TypeDef *flashx)
{
  return ((STM32_READ_BIT(flashx->CR, FLASH_CR_INCERRIE) == (FLASH_CR_INCERRIE)) ? 1UL : 0UL);
}

/**
  * @brief  Enable the flash option-byte change error interrupt.
  * @rmtoll
  *  CR          OPTCHANGEERRIE        LL_FLASH_EnableIT_OPTCHANGEERR
  * @param  flashx FLASH instance.
  */
__STATIC_INLINE void LL_FLASH_EnableIT_OPTCHANGEERR(FLASH_TypeDef *flashx)
{
  STM32_SET_BIT(flashx->CR, FLASH_CR_OPTCHANGEERRIE);
}

/**
  * @brief  Disable the flash option-byte change error interrupt.
  * @rmtoll
  *  CR          OPTCHANGEERRIE        LL_FLASH_DisableIT_OPTCHANGEERR
  * @param  flashx FLASH instance.
  */
__STATIC_INLINE void LL_FLASH_DisableIT_OPTCHANGEERR(FLASH_TypeDef *flashx)
{
  STM32_CLEAR_BIT(flashx->CR, FLASH_CR_OPTCHANGEERRIE);
}

/**
  * @brief  Check if the flash option-byte change error interrupt is enabled or disabled.
  * @rmtoll
  *  CR          OPTCHANGEERRIE        LL_FLASH_IsEnabledIT_OPTCHANGEERR
  * @param  flashx FLASH instance.
  * @retval State of flash OPTCHANGEERR interruption (1 enabled / 0 disabled).
  */
__STATIC_INLINE uint32_t LL_FLASH_IsEnabledIT_OPTCHANGEERR(const FLASH_TypeDef *flashx)
{
  return ((STM32_READ_BIT(flashx->CR, FLASH_CR_OPTCHANGEERRIE) == (FLASH_CR_OPTCHANGEERRIE)) ? 1UL : 0UL);
}

/**
  * @brief  Set the privilege attribute.
  * @rmtoll
  *  PRIVCFGR     PRIV        LL_FLASH_SetPrivAttr
  * @param  flashx    FLASH instance.
  * @param  item      The item attribute to be configured.
  *                   This parameter can be one of the following values:
  *                   @arg @ref LL_FLASH_PRIV_ITEM_ALL
  * @param  priv_attr This parameter can be one of the following values:
  *         @arg @ref LL_FLASH_ATTR_NPRIV
  *         @arg @ref LL_FLASH_ATTR_PRIV
  * @note  This register can be written only when the access is privileged.
  */
__STATIC_INLINE void LL_FLASH_SetPrivAttr(FLASH_TypeDef *flashx, uint32_t item, uint32_t priv_attr)
{
  STM32_MODIFY_REG(flashx->PRIVCFGR, item, (item * priv_attr));
}

/**
  * @brief  Get the privilege attribute.
  * @rmtoll
  *  PRIVCFGR     PRIV        LL_FLASH_GetPrivAttr
  * @param  flashx FLASH instance.
  * @param  item   The item attribute to be queried.
  *                This parameter can be one of the following values:
  *                @arg @ref LL_FLASH_PRIV_ITEM_ALL
  * @return Returned value can be one of the following values:
  *         @arg @ref LL_FLASH_ATTR_NPRIV
  *         @arg @ref LL_FLASH_ATTR_PRIV
  */
__STATIC_INLINE uint32_t LL_FLASH_GetPrivAttr(const FLASH_TypeDef *flashx, uint32_t item)
{
  return ((STM32_READ_BIT(flashx->PRIVCFGR, item) == item) ? LL_FLASH_ATTR_PRIV : LL_FLASH_ATTR_NPRIV);
}

/**
  * @brief  Set the flash page configuration for extended hide protection area by bank.
  * @rmtoll
  *  HDPEXTR       HDP1_EXT/HDP2_EXT          LL_FLASH_SetHDPExtArea
  * @param  flashx FLASH instance.
  * @param  bank
  *         This parameter can be one of the following values:
  *         @arg @ref LL_FLASH_HDPEXT_BANK_1
  *         @arg @ref LL_FLASH_HDPEXT_BANK_2
  * @param  page_nbr
  *         This parameter can be a value between 0x00U and the maximum number of pages by bank.
  */
__STATIC_INLINE void LL_FLASH_SetHDPExtArea(FLASH_TypeDef *flashx, uint32_t bank, uint32_t page_nbr)
{
  STM32_MODIFY_REG(flashx->HDPEXTR, FLASH_HDPEXTR_HDP1_EXT_Msk << bank, page_nbr << bank);
}

/**
  * @brief  Get the flash page configuration for extended hide protection area by bank.
  * @rmtoll
  *  HDPEXTR       HDP1_EXT/HDP2_EXT          LL_FLASH_GetHDPExtArea
  * @param  flashx FLASH instance.
  * @param  bank
  *         This parameter can be one of the following values:
  *         @arg @ref LL_FLASH_HDPEXT_BANK_1
  *         @arg @ref LL_FLASH_HDPEXT_BANK_2
  * @retval Returned value can be a value between 0x00U and the maximum number of pages by bank.
  */
__STATIC_INLINE uint32_t LL_FLASH_GetHDPExtArea(const FLASH_TypeDef *flashx, const uint32_t bank)
{
  return (STM32_READ_BIT(flashx->HDPEXTR, FLASH_HDPEXTR_HDP1_EXT_Msk << bank) >> bank);
}

/**
  * @}
  */

/** @defgroup FLASH_LL_EF_OB_Management LL FLASH Option Bytes Management
  * @{
  */

/**
  * @brief  Set the flash independent watchdog selection.
  * @rmtoll
  *  OPTSR           IWDG_SW           LL_FLASH_OB_SetIWDGSelection
  * @param  flashx FLASH instance.
  * @param  hw_sw_selection
  *         This parameter can be one of the following values:
  *         @arg @ref LL_FLASH_OB_IWDG_HW
  *         @arg @ref LL_FLASH_OB_IWDG_SW
  */
__STATIC_INLINE void LL_FLASH_OB_SetIWDGSelection(FLASH_TypeDef *flashx, uint32_t hw_sw_selection)
{
  STM32_MODIFY_REG(flashx->OPTSR_PRG, FLASH_OPTSR_PRG_IWDG_SW, hw_sw_selection);
}

/**
  * @brief  Get the flash independent watchdog selection.
  * @rmtoll
  *  OPTSR           IWDG_SW           LL_FLASH_OB_GetIWDGSelection
  * @param  flashx FLASH instance.
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_FLASH_OB_IWDG_HW
  *         @arg @ref LL_FLASH_OB_IWDG_SW
  */
__STATIC_INLINE uint32_t LL_FLASH_OB_GetIWDGSelection(const FLASH_TypeDef *flashx)
{
  return (STM32_READ_BIT(flashx->OPTSR_CUR, FLASH_OPTSR_PRG_IWDG_SW));
}

/**
  * @brief  Set the flash window watchdog selection.
  * @rmtoll
  *  OPTSR_PRG           WWDG_SW           LL_FLASH_OB_SetWWDGSelection
  * @param  flashx FLASH instance.
  * @param  hw_sw_selection
  *         This parameter can be one of the following values:
  *         @arg @ref LL_FLASH_OB_WWDG_HW
  *         @arg @ref LL_FLASH_OB_WWDG_SW
  */
__STATIC_INLINE void LL_FLASH_OB_SetWWDGSelection(FLASH_TypeDef *flashx, uint32_t hw_sw_selection)
{
  STM32_MODIFY_REG(flashx->OPTSR_PRG, FLASH_OPTSR_PRG_WWDG_SW, hw_sw_selection);
}

/**
  * @brief  Get the flash window watchdog selection.
  * @rmtoll
  *  OPTSR_CUR           WWDG_SW           LL_FLASH_OB_GetWWDGSelection
  * @param  flashx FLASH instance.
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_FLASH_OB_WWDG_HW
  *         @arg @ref LL_FLASH_OB_WWDG_SW
  */
__STATIC_INLINE uint32_t LL_FLASH_OB_GetWWDGSelection(const FLASH_TypeDef *flashx)
{
  return (STM32_READ_BIT(flashx->OPTSR_CUR, FLASH_OPTSR_PRG_WWDG_SW));
}

/**
  * @brief  Set the flash reset generation in stop mode.
  * @rmtoll
  *  OPTSR_PRG           NRST_STOP           LL_FLASH_OB_SetNRSTStopMode
  * @param  flashx FLASH instance.
  * @param  rst_generation
  *         This parameter can be one of the following values:
  *         @arg @ref LL_FLASH_OB_RST_STOP_MODE
  *         @arg @ref LL_FLASH_OB_NO_RST_STOP_MODE
  */
__STATIC_INLINE void LL_FLASH_OB_SetNRSTStopMode(FLASH_TypeDef *flashx, uint32_t rst_generation)
{
  STM32_MODIFY_REG(flashx->OPTSR_PRG, FLASH_OPTSR_PRG_NRST_STOP, rst_generation);
}

/**
  * @brief  Get the flash reset generation in stop mode.
  * @rmtoll
  *  OPTSR_CUR           NRST_STOP           LL_FLASH_OB_GetNRSTStopMode
  * @param  flashx FLASH instance.
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_FLASH_OB_RST_STOP_MODE
  *         @arg @ref LL_FLASH_OB_NO_RST_STOP_MODE
  */
__STATIC_INLINE uint32_t LL_FLASH_OB_GetNRSTStopMode(const FLASH_TypeDef *flashx)
{
  return (STM32_READ_BIT(flashx->OPTSR_CUR, FLASH_OPTSR_PRG_NRST_STOP));
}

