MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/ll/stm32c5xx_ll_flash.h
/**
  * @brief  Set the flash reset generation in standby mode.
  * @rmtoll
  *  OPTSR_PRG           NRST_STDBY           LL_FLASH_OB_SetNRSTStandbyMode
  * @param  flashx FLASH instance.
  * @param  rst_generation
  *         This parameter can be one of the following values:
  *         @arg @ref LL_FLASH_OB_RST_STDBY_MODE
  *         @arg @ref LL_FLASH_OB_NO_RST_STDBY_MODE
  */
__STATIC_INLINE void LL_FLASH_OB_SetNRSTStandbyMode(FLASH_TypeDef *flashx, uint32_t rst_generation)
{
  STM32_MODIFY_REG(flashx->OPTSR_PRG, FLASH_OPTSR_PRG_NRST_STDBY, rst_generation);
}

/**
  * @brief  Get the flash reset generation in standby mode.
  * @rmtoll
  *  OPTSR_CUR           NRST_STDBY           LL_FLASH_OB_GetNRSTStandbyMode
  * @param  flashx FLASH instance.
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_FLASH_OB_RST_STDBY_MODE
  *         @arg @ref LL_FLASH_OB_NO_RST_STDBY_MODE
  */
__STATIC_INLINE uint32_t LL_FLASH_OB_GetNRSTStandbyMode(const FLASH_TypeDef *flashx)
{
  return (STM32_READ_BIT(flashx->OPTSR_CUR, FLASH_OPTSR_PRG_NRST_STDBY));
}

/**
  * @brief Set the flash RDP level.
  * @rmtoll
  *  OPSR_PRG           RDP_LEVEL           LL_FLASH_OB_SetRDPLevel
  * @param  flashx FLASH instance.
  * @param  rdp_level
  *         This parameter can be one of the following values:
  *         @arg @ref LL_FLASH_OB_RDP_LEVEL_0
  *         @arg @ref LL_FLASH_OB_RDP_LEVEL_2_WBS
  *         @arg @ref LL_FLASH_OB_RDP_LEVEL_2
  */
__STATIC_INLINE void LL_FLASH_OB_SetRDPLevel(FLASH_TypeDef *flashx, uint32_t rdp_level)
{
  STM32_MODIFY_REG(flashx->OPTSR_PRG, FLASH_OPTSR_PRG_RDP_LEVEL, rdp_level << FLASH_OPTSR_PRG_RDP_LEVEL_Pos);
}

/**
  * @brief  Get the flash RDP level.
  * @rmtoll
  *  OPTSR_PGR           RDP_LEVEL           LL_FLASH_OB_GetRDPLevel
  * @param  flashx FLASH instance.
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_FLASH_OB_RDP_LEVEL_0
  *         @arg @ref LL_FLASH_OB_RDP_LEVEL_2_WBS
  *         @arg @ref LL_FLASH_OB_RDP_LEVEL_2
  */
__STATIC_INLINE uint32_t LL_FLASH_OB_GetRDPLevel(const FLASH_TypeDef *flashx)
{
  return (STM32_READ_BIT(flashx->OPTSR_CUR, FLASH_OPTSR_PRG_RDP_LEVEL) >> FLASH_OPTSR_PRG_RDP_LEVEL_Pos);
}

/**
  * @brief  Freeze the flash independent watchdog counter in stop mode.
  * @rmtoll
  *  OPTSR_PRG           IWDG_STOP           LL_FLASH_OB_FreezeIWDGStopMode
  * @param  flashx FLASH instance.
  */
__STATIC_INLINE void LL_FLASH_OB_FreezeIWDGStopMode(FLASH_TypeDef *flashx)
{
  STM32_CLEAR_BIT(flashx->OPTSR_PRG, FLASH_OPTSR_PRG_IWDG_STOP);
}

/**
  * @brief  Unfreeze the flash independent watchdog counter in stop mode.
  * @rmtoll
  *  OPTSR_PRG           IWDG_STOP           LL_FLASH_OB_UnfreezeIWDGStopMode
  * @param  flashx FLASH instance.
  */
__STATIC_INLINE void LL_FLASH_OB_UnfreezeIWDGStopMode(FLASH_TypeDef *flashx)
{
  STM32_SET_BIT(flashx->OPTSR_PRG, FLASH_OPTSR_PRG_IWDG_STOP);
}

/**
  * @brief  Check the flash independent watchdog counter in stop mode is frozen.
  * @rmtoll
  *  OPTSR_CUR           IWDG_STOP           LL_FLASH_OB_IsFrozenIWDGStopMode
  * @param  flashx FLASH instance.
  * @retval State of flash option bytes IWDG counter in stop mode (1 frozen / 0 not frozen).
  */
__STATIC_INLINE uint32_t LL_FLASH_OB_IsFrozenIWDGStopMode(const FLASH_TypeDef *flashx)
{
  return ((STM32_READ_BIT(flashx->OPTSR_CUR, FLASH_OPTSR_PRG_IWDG_STOP) == (FLASH_OPTSR_PRG_IWDG_STOP)) ? 0UL : 1UL);
}

/**
  * @brief  Freeze the flash independent watchdog counter in standby mode.
  * @rmtoll
  *  OPTSR_PRG           IWDG_STDBY           LL_FLASH_OB_FreezeIWDGStandbyMode
  * @param  flashx FLASH instance.
  */
__STATIC_INLINE void LL_FLASH_OB_FreezeIWDGStandbyMode(FLASH_TypeDef *flashx)
{
  STM32_CLEAR_BIT(flashx->OPTSR_PRG, FLASH_OPTSR_PRG_IWDG_STDBY);
}

/**
  * @brief  Unfreeze the flash independent watchdog counter in standby mode.
  * @rmtoll
  *  OPTSR_PRG           IWDG_STDBY           LL_FLASH_OB_UnfreezeIWDGStandbyMode
  * @param  flashx FLASH instance.
  */
__STATIC_INLINE void LL_FLASH_OB_UnfreezeIWDGStandbyMode(FLASH_TypeDef *flashx)
{
  STM32_SET_BIT(flashx->OPTSR_PRG, FLASH_OPTSR_PRG_IWDG_STDBY);
}

/**
  * @brief  Check the flash independent watchdog counter in standby mode is frozen.
  * @rmtoll
  *  OPTSR_CUR           IWDG_STDBY           LL_FLASH_OB_IsFrozenIWDGStandbyMode
  * @param  flashx FLASH instance.
  * @retval State of flash option bytes IWDG counter in standby mode (1 frozen / 0 not frozen).
  */
__STATIC_INLINE uint32_t LL_FLASH_OB_IsFrozenIWDGStandbyMode(const FLASH_TypeDef *flashx)
{
  return ((STM32_READ_BIT(flashx->OPTSR_CUR, FLASH_OPTSR_PRG_IWDG_STDBY) == (FLASH_OPTSR_PRG_IWDG_STDBY)) ? 0UL : 1UL);
}

/**
  * @brief  Set the flash software boot0.
  * @rmtoll
  *  OPTSR_PRG           BOOT_SEL           LL_FLASH_OB_SetBoot0SourceSelection
  * @param  flashx FLASH instance.
  * @param  boot_sel
  *         This parameter can be one of the following values:
  *         @arg @ref LL_FLASH_OB_BOOT0_BOOT0
  *         @arg @ref LL_FLASH_OB_BOOT0_BOOTPIN
  */
__STATIC_INLINE void LL_FLASH_OB_SetBoot0SourceSelection(FLASH_TypeDef *flashx, uint32_t boot_sel)
{
  STM32_MODIFY_REG(flashx->OPTSR_PRG, FLASH_OPTSR_PRG_BOOT_SEL, boot_sel);
}

/**
  * @brief  Get the flash software boot0.
  * @rmtoll
  *  OPTSR_CUR           BOOT_SEL           LL_FLASH_OB_GetBoot0SourceSelection
  * @param  flashx FLASH instance.
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_FLASH_OB_BOOT0_BOOT0
  *         @arg @ref LL_FLASH_OB_BOOT0_BOOTPIN
  */
__STATIC_INLINE uint32_t LL_FLASH_OB_GetBoot0SourceSelection(const FLASH_TypeDef *flashx)
{
  return (STM32_READ_BIT(flashx->OPTSR_CUR, FLASH_OPTSR_PRG_BOOT_SEL));
}

/**
  * @brief  Set the flash BOOT0 option bit.
  * @rmtoll
  *  OPTSR_PRG           BOOT0           LL_FLASH_OB_SetBoot0
  * @param  flashx FLASH instance.
  * @param  boot0
  *         This parameter can be one of the following values:
  *         @arg @ref LL_FLASH_OB_BOOT0_DISABLED
  *         @arg @ref LL_FLASH_OB_BOOT0_ENABLED
  */
__STATIC_INLINE void LL_FLASH_OB_SetBoot0(FLASH_TypeDef *flashx, uint32_t boot0)
{
  STM32_MODIFY_REG(flashx->OPTSR_PRG, FLASH_OPTSR_PRG_BOOT0, boot0);
}

/**
  * @brief  Get the flash BOOT0 option bit.
  * @rmtoll
  *  OPTSR_CUR           BOOT0           LL_FLASH_OB_GetBoot0
  * @param  flashx FLASH instance.
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_FLASH_OB_BOOT0_DISABLED
  *         @arg @ref LL_FLASH_OB_BOOT0_ENABLED
  */
__STATIC_INLINE uint32_t LL_FLASH_OB_GetBoot0(const FLASH_TypeDef *flashx)
{
  return (STM32_READ_BIT(flashx->OPTSR_CUR, FLASH_OPTSR_PRG_BOOT0));
}

/**
  * @brief  Set the flash NBOOT0 option bit.
  * @rmtoll
  *  OPTSR_PRG           BOOT_SEL|BOOT0           LL_FLASH_OB_SetBoot0Config
  * @param  flashx FLASH instance.
  * @param  boot0
  *         This parameter can be one of the following values:
  *         @arg @ref LL_FLASH_OB_BOOT0_DISABLED
  *         @arg @ref LL_FLASH_OB_BOOT0_ENABLED
  *         @arg @ref LL_FLASH_OB_BOOT0_BOOTPIN
  */
__STATIC_INLINE void LL_FLASH_OB_SetBoot0Config(FLASH_TypeDef *flashx, uint32_t boot0)
{
  STM32_MODIFY_REG(flashx->OPTSR_PRG, (FLASH_OPTSR_PRG_BOOT_SEL | FLASH_OPTSR_PRG_BOOT0), boot0);
}

/**
  * @brief  Get the flash NBOOT0 option bit.
  * @rmtoll
  *  OPTSR_CUR           BOOT_SEL|BOOT0           LL_FLASH_OB_GetBoot0Config
  * @param  flashx FLASH instance.
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_FLASH_OB_BOOT0_DISABLED
  *         @arg @ref LL_FLASH_OB_BOOT0_ENABLED
  *         @arg @ref LL_FLASH_OB_BOOT0_BOOTPIN
  */
__STATIC_INLINE uint32_t LL_FLASH_OB_GetBoot0Config(const FLASH_TypeDef *flashx)
{
  return (STM32_READ_BIT(flashx->OPTSR_CUR, (FLASH_OPTSR_PRG_BOOT_SEL | FLASH_OPTSR_PRG_BOOT0)));
}

/**
  * @brief  Enable the data flash area.
  * @rmtoll
  *  OPTSR_PRG    EDATA_EN   LL_FLASH_OB_EnableEDATAArea
  * @param  flashx FLASH instance.
  */
__STATIC_INLINE void LL_FLASH_OB_EnableEDATAArea(FLASH_TypeDef *flashx)
{
  STM32_SET_BIT(flashx->OPTSR_PRG, FLASH_OPTSR_PRG_EDATA_EN);
}

/**
  * @brief  Disable the data flash area.
  * @rmtoll
  *  OPTSR_PRG   EDATA_EN   LL_FLASH_OB_DisableEDATAArea
  * @param  flashx FLASH instance.
  */
__STATIC_INLINE void LL_FLASH_OB_DisableEDATAArea(FLASH_TypeDef *flashx)
{
  STM32_CLEAR_BIT(flashx->OPTSR_PRG, FLASH_OPTSR_PRG_EDATA_EN);
}

/**
  * @brief  Check if the data flash area is enabled or disabled.
  * @rmtoll
  *  OPTSR_CUR   EDATA_EN   LL_FLASH_OB_IsEnabledEDATAArea
  * @param  flashx FLASH instance.
  * @retval State of flash option bit EDATA_EN (1 enabled / 0 disabled).
  */
__STATIC_INLINE uint32_t LL_FLASH_OB_IsEnabledEDATAArea(const FLASH_TypeDef *flashx)
{
  return ((STM32_READ_BIT(flashx->OPTSR_CUR, FLASH_OPTSR_PRG_EDATA_EN) == (FLASH_OPTSR_PRG_EDATA_EN)) ? 1UL : 0UL);
}

/**
  * @brief  Set the single/dual bank configuration for products with less user memory.
  * @rmtoll
  *  OPTSR_PRG    SINGLE_BANK   LL_FLASH_OB_SetBank
  * @param  flashx FLASH instance.
  * @param  single_dual_bank
  *         This parameter can be one of the following values:
  *         @arg @ref LL_FLASH_OB_SINGLE_BANK
  *         @arg @ref LL_FLASH_OB_DUAL_BANK
  */
__STATIC_INLINE void LL_FLASH_OB_SetBank(FLASH_TypeDef *flashx, uint32_t single_dual_bank)
{
  STM32_MODIFY_REG(flashx->OPTSR_PRG, FLASH_OPTSR_PRG_SINGLE_BANK, single_dual_bank);
}

/**
  * @brief Get the single/dual bank configuration for products with less of user memory.
  * @rmtoll
  *  OPTSR_CUR   SINGLE_BANK   LL_FLASH_OB_GetBank
  * @param  flashx FLASH instance.
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_FLASH_OB_SINGLE_BANK
  *         @arg @ref LL_FLASH_OB_DUAL_BANK
  */
__STATIC_INLINE uint32_t LL_FLASH_OB_GetBank(const FLASH_TypeDef *flashx)
{
  return (STM32_READ_BIT(flashx->OPTSR_CUR, FLASH_OPTSR_PRG_SINGLE_BANK));
}

/**
  * @brief  Set the flash swap banks.
  * @rmtoll
  *  OPTSR_PRG           SWAP_BANK           LL_FLASH_OB_SetSwapBank
  * @param  flashx FLASH instance.
  * @param  swap_bank
  *         This parameter can be one of the following values:
  *         @arg @ref LL_FLASH_OB_BANK_NOT_SWAPPED
  *         @arg @ref LL_FLASH_OB_BANK_SWAPPED
  */
__STATIC_INLINE void LL_FLASH_OB_SetSwapBank(FLASH_TypeDef *flashx, uint32_t swap_bank)
{
  STM32_MODIFY_REG(flashx->OPTSR_PRG, FLASH_OPTSR_PRG_SWAP_BANK, swap_bank);
}

/**
  * @brief  Get the flash swap banks.
  * @rmtoll
  *  OPTSR_CUR          SWAP_BANK        LL_FLASH_OB_GetSwapBank
  * @param  flashx FLASH instance.
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_FLASH_OB_BANK_NOT_SWAPPED
  *         @arg @ref LL_FLASH_OB_BANK_SWAPPED
  */
__STATIC_INLINE uint32_t LL_FLASH_OB_GetSwapBank(const FLASH_TypeDef *flashx)
{
  return (STM32_READ_BIT(flashx->OPTSR_CUR, FLASH_OPTSR_PRG_SWAP_BANK));
}


/**
  * @brief  Set the flash erase SRAM1 upon system reset.
  * @rmtoll
  *  OPTSR2_PRG           SRAM1_RST           LL_FLASH_OB_SetSystemResetSRAM1Erase
  * @param  flashx FLASH instance.
  * @param  erase_sram
  *         This parameter can be one of the following values:
  *         @arg @ref LL_FLASH_OB_ERASED_SRAM1_SYS_RST
  *         @arg @ref LL_FLASH_OB_NOT_ERASED_SRAM1_SYS_RST
  */
__STATIC_INLINE void LL_FLASH_OB_SetSystemResetSRAM1Erase(FLASH_TypeDef *flashx, uint32_t erase_sram)
{
  STM32_MODIFY_REG(flashx->OPTSR2_PRG, FLASH_OPTSR2_PRG_SRAM1_RST, erase_sram);
}

/**
  * @brief  Get the flash erase SRAM1 upon system reset.
  * @rmtoll
  *  OPTSR2_CUR           SRAM1_RST           LL_FLASH_OB_GetSystemResetSRAM1Erase
  * @param  flashx FLASH instance.
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_FLASH_OB_ERASED_SRAM1_SYS_RST
  *         @arg @ref LL_FLASH_OB_NOT_ERASED_SRAM1_SYS_RST
  */
__STATIC_INLINE uint32_t LL_FLASH_OB_GetSystemResetSRAM1Erase(const FLASH_TypeDef *flashx)
{
  return (STM32_READ_BIT(flashx->OPTSR2_CUR, FLASH_OPTSR2_PRG_SRAM1_RST));
}

/**
  * @brief  Enable the flash SRAM2 ECC.
  * @rmtoll
  *  OPTSR2_PRG           SRAM2_ECC           LL_FLASH_OB_EnableECCSRAM2
  * @param  flashx FLASH instance.
  */
__STATIC_INLINE void LL_FLASH_OB_EnableECCSRAM2(FLASH_TypeDef *flashx)
{
  STM32_CLEAR_BIT(flashx->OPTSR2_PRG, FLASH_OPTSR2_PRG_SRAM2_ECC);
}

/**
  * @brief  Disable the flash SRAM2 ECC.
  * @rmtoll
  *  OPTSR2_PRG           SRAM2_ECC           LL_FLASH_OB_DisableECCSRAM2
  * @param  flashx FLASH instance.
  */
__STATIC_INLINE void LL_FLASH_OB_DisableECCSRAM2(FLASH_TypeDef *flashx)
{
  STM32_SET_BIT(flashx->OPTSR2_PRG, FLASH_OPTSR2_PRG_SRAM2_ECC);
}

/**
  * @brief  Check if the flash SRAM2 ECC is enabled or disabled.
  * @rmtoll
  *  OPTSR2_CUR           SRAM2_ECC           LL_FLASH_OB_IsEnabledECCSRAM2
  * @param  flashx FLASH instance.
  * @retval State of flash option bytes ECCSRAM2 (1 enabled / 0 disabled).
  */
__STATIC_INLINE uint32_t LL_FLASH_OB_IsEnabledECCSRAM2(const FLASH_TypeDef *flashx)
{
  return ((STM32_READ_BIT(flashx->OPTSR2_CUR, FLASH_OPTSR2_PRG_SRAM2_ECC) == (FLASH_OPTSR2_PRG_SRAM2_ECC)) ? 0UL : 1UL);
}

/**
  * @brief  Set the flash SRAM2 erase upon system reset.
  * @rmtoll
  *  OPTSR2_PRG           SRAM2_RST           LL_FLASH_OB_SetSystemResetSRAM2Erase
  * @param  flashx FLASH instance.
  * @param  erase_sram2
  *         This parameter can be one of the following values:
  *         @arg @ref LL_FLASH_OB_ERASED_SRAM2_SYS_RST
  *         @arg @ref LL_FLASH_OB_NOT_ERASED_SRAM2_SYS_RST
  */
__STATIC_INLINE void LL_FLASH_OB_SetSystemResetSRAM2Erase(FLASH_TypeDef *flashx, uint32_t erase_sram2)
{
  STM32_MODIFY_REG(flashx->OPTSR2_PRG, FLASH_OPTSR2_PRG_SRAM2_RST, erase_sram2);
}

/**
  * @brief  Get the flash SRAM2 erase upon system reset.
  * @rmtoll
  *  OPTSR2_CUR           SRAM2_RST           LL_FLASH_OB_GetSystemResetSRAM2Erase
  * @param  flashx FLASH instance.
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_FLASH_OB_ERASED_SRAM2_SYS_RST
  *         @arg @ref LL_FLASH_OB_NOT_ERASED_SRAM2_SYS_RST
  */
__STATIC_INLINE uint32_t LL_FLASH_OB_GetSystemResetSRAM2Erase(const FLASH_TypeDef *flashx)
{
  return (STM32_READ_BIT(flashx->OPTSR2_CUR, FLASH_OPTSR2_PRG_SRAM2_RST));
}

/**
  * @brief  Lock the flash boot address.
  * @rmtoll
  *  SECBOOTR          BOOT_LOCK          LL_FLASH_OB_LockBootConfig
  * @param  flashx FLASH instance.
  */
__STATIC_INLINE void LL_FLASH_OB_LockBootConfig(FLASH_TypeDef *flashx)
{
  STM32_MODIFY_REG(flashx->BOOTR_PRG, FLASH_BOOTR_PRG_BOOT_LOCK, LL_FLASH_OB_BOOT_LOCKED);
}

/**
  * @brief  Unlock the flash boot address.
  * @rmtoll
  *  BOOTR          BOOT_LOCK          LL_FLASH_OB_UnlockBootConfig
  * @param  flashx FLASH instance.
  */
__STATIC_INLINE void LL_FLASH_OB_UnlockBootConfig(FLASH_TypeDef *flashx)
{
  STM32_MODIFY_REG(flashx->BOOTR_PRG, FLASH_BOOTR_PRG_BOOT_LOCK, LL_FLASH_OB_BOOT_NOT_LOCKED);
}

/**
  * @brief  Check the flash boot address lock state.
  * @rmtoll
  *  BOOTR          BOOT_LOCK          LL_FLASH_OB_IsLockedBootConfig
  * @param  flashx FLASH instance.
  * @retval State of boot address lock ( 1: locked, 0 unlocked)
  */
__STATIC_INLINE uint32_t LL_FLASH_OB_IsLockedBootConfig(const FLASH_TypeDef *flashx)
{
  return ((STM32_READ_BIT(flashx->BOOTR_CUR, FLASH_BOOTR_PRG_BOOT_LOCK) == LL_FLASH_OB_BOOT_LOCKED) ? 1UL : 0UL);
}
/**
  * @brief  Set the flash boot base address.
  * @rmtoll
  *  BOOTR_PRG          BOOTADD          LL_FLASH_OB_SetBootAddr
  * @param  flashx FLASH instance.
  * @param  boot_addr
  *         This parameter can be a value between 0x00000000U and 0xFFFFFFFFU.
  */
__STATIC_INLINE void LL_FLASH_OB_SetBootAddr(FLASH_TypeDef *flashx, uint32_t boot_addr)
{
  STM32_MODIFY_REG(flashx->BOOTR_PRG, FLASH_BOOTR_PRG_BOOTADD, boot_addr);
}

/**
  * @brief  Get the flash boot base address.
  * @rmtoll
  *  BOOTR_CUR          BOOTADD          LL_FLASH_OB_GetBootAddr
  * @param  flashx FLASH instance.
  * @retval Returned value can be a value between 0x00000000U and 0xFFFFFFFFU.
  */
__STATIC_INLINE uint32_t LL_FLASH_OB_GetBootAddr(const FLASH_TypeDef *flashx)
{
  return (STM32_READ_BIT(flashx->BOOTR_CUR, FLASH_BOOTR_PRG_BOOTADD));
}

/**
  * @brief  Enable the flash OTP locking protection for the selected blocks.
  * @rmtoll
  *  OTPBLR_PRG          LOCKBL          LL_FLASH_OB_LockOTPBlock
  * @param  flashx FLASH instance.
  * @param  block specifies the OTP blocks to be locked.
  *         This parameter can be any combination of @ref LL_FLASH_OB_OTP_Lock_Blocks possible values.
  */
__STATIC_INLINE void LL_FLASH_OB_LockOTPBlock(FLASH_TypeDef *flashx, uint32_t block)
{
  STM32_SET_BIT(flashx->OTPBLR_PRG, (FLASH_OTPBLR_PRG_LOCKBL & block));
}

/**
  * @brief  Get the flash OTP locking protection by block.
  * @rmtoll
  *  OTPBLR_CUR          LOCKBL          LL_FLASH_OB_IsLockedOTPBlock
  * @param  flashx FLASH instance.
  * @param  block specifies the OTP blocks to check.
  *         This parameter can be any combination of @ref LL_FLASH_OB_OTP_Lock_Blocks possible values.
  * @retval 1 if all blocks specified by blocks are locked, 0 otherwise.
  */
__STATIC_INLINE uint32_t LL_FLASH_OB_IsLockedOTPBlock(const FLASH_TypeDef *flashx, const uint32_t block)
{
  const uint32_t masked_block = block & FLASH_OTPBLR_PRG_LOCKBL;
  return (((STM32_READ_BIT(flashx->OTPBLR_CUR, FLASH_OTPBLR_PRG_LOCKBL) & masked_block) == masked_block) ? 1UL : 0UL);
}

/**
  * @brief  Set the bootloader interface configuration.
  * @rmtoll
  *  BL_COM_CFGR         BL_COM_CFG          LL_FLASH_OB_SetBootloaderInterfaceConfig
  * @param  flashx FLASH instance.
  * @param  bootloader_config specifies the bootloader interface configuration to set.
  *         This parameter can be any value between 0x00000000 and 0xFFFFFFFF.
  */
__STATIC_INLINE void LL_FLASH_OB_SetBootloaderInterfaceConfig(FLASH_TypeDef *flashx, uint32_t bootloader_config)
{
  STM32_WRITE_REG(flashx->BL_COM_CFG_PRG, bootloader_config);
}

/**
  * @brief  Get the bootloader interface configuration.
  * @rmtoll
  *  BL_COM_CFGR         BL_COM_CFG          LL_FLASH_OB_GetBootloaderInterfaceConfig
  * @param  flashx FLASH instance.
  * @retval Returned value can be a value between 0x00000000 and 0xFFFFFFFF.
  */
__STATIC_INLINE uint32_t LL_FLASH_OB_GetBootloaderInterfaceConfig(const FLASH_TypeDef *flashx)
{
  return STM32_READ_BIT(flashx->BL_COM_CFG_CUR, FLASH_BL_COM_CFG_PRG_BL_COM_CFG);
}

/**
  * @brief  Set the flash OEM key first word.
  * @rmtoll
  *  OEMKEYR1    OEMKEY   LL_FLASH_OB_SetOEMKeyWord1
  * @param  flashx FLASH instance.
  * @param  oem_key_word First 32-bit word of the 128-bit OEM key value to set
  */
__STATIC_INLINE void LL_FLASH_OB_SetOEMKeyWord1(FLASH_TypeDef *flashx, uint32_t oem_key_word)
{
  STM32_WRITE_REG(flashx->OEMKEYR1_PRG, oem_key_word);
}

/**
  * @brief  Set the flash OEM key second word.
  * @rmtoll
  *  OEMKEYR2    OEMKEY   LL_FLASH_OB_SetOEMKeyWord2
  * @param  flashx FLASH instance.
  * @param  oem_key_word Second 32-bit word of the 128-bit OEM key value to set
  */
__STATIC_INLINE void LL_FLASH_OB_SetOEMKeyWord2(FLASH_TypeDef *flashx, uint32_t oem_key_word)
{
  STM32_WRITE_REG(flashx->OEMKEYR2_PRG, oem_key_word);
}

/**
  * @brief  Set the flash OEM key third word.
  * @rmtoll
  *  OEMKEYR3    OEMKEY   LL_FLASH_OB_SetOEMKeyWord3
  * @param  flashx FLASH instance.
  * @param  oem_key_word Third 32-bit word of the 128-bit OEM key value to set
  */
__STATIC_INLINE void LL_FLASH_OB_SetOEMKeyWord3(FLASH_TypeDef *flashx, uint32_t oem_key_word)
{
  STM32_WRITE_REG(flashx->OEMKEYR3_PRG, oem_key_word);
}

/**
  * @brief  Set the flash OEM key second word.
  * @rmtoll
  *  OEMKEYR4    OEMKEY   LL_FLASH_OB_SetOEMKeyWord4
  * @param  flashx FLASH instance.
  * @param  oem_key_word Second 32-bit word of the 128-bit OEM key value to set
  */
__STATIC_INLINE void LL_FLASH_OB_SetOEMKeyWord4(FLASH_TypeDef *flashx, uint32_t oem_key_word)
{
  STM32_WRITE_REG(flashx->OEMKEYR4_PRG, oem_key_word);
}

/**
  * @brief  Set the flash BS key.
  * @rmtoll
  *  BSKEYR    BSKEY   LL_FLASH_OB_SetBSKey
  * @param  flashx FLASH instance.
  * @param  bs_key BS key value to set
  */
__STATIC_INLINE void LL_FLASH_OB_SetBSKey(FLASH_TypeDef *flashx, uint32_t bs_key)
{
  STM32_WRITE_REG(flashx->BSKEYR_PRG, bs_key);

