MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/ll/stm32c5xx_ll_flash.h
}

/**
  * @brief  Enable the flash write protection on the selected pages of the selected bank.
  * @rmtoll
  *  WRP1R/WRP2R          WRP1R_WRPSG/WRP2R_WRPSG          LL_FLASH_OB_EnablePageWRP
  * @param  flashx FLASH instance.
  * @param  bank
  *         This parameter can be one of the following values:
  *         @arg @ref LL_FLASH_BANK_1
  *         @arg @ref LL_FLASH_BANK_2
  * @param  page specifies the pages to be write protected.
  *         This parameter can be any combination of @ref LL_FLASH_OB_Write_Protection_Pages possible values.
  */
__STATIC_INLINE void LL_FLASH_OB_EnablePageWRP(FLASH_TypeDef *flashx, uint32_t bank, uint32_t page)
{
  __IO uint32_t *reg_addr = (bank == LL_FLASH_BANK_1) ? &flashx->WRP1R_PRG : &flashx->WRP2R_PRG;
  STM32_CLEAR_BIT(*reg_addr, (FLASH_WRP1R_PRG_WRPSG1 & page));
}

/**
  * @brief  Disable the flash write protection on the selected pages of the selected bank.
  * @rmtoll
  *  WRP1R/WRP2R          WRP1R_WRPSG/WRP2R_WRPSG          LL_FLASH_OB_DisablePageWRP
  * @param  flashx FLASH instance.
  * @param  bank
  *         This parameter can be one of the following values:
  *         @arg @ref LL_FLASH_BANK_1
  *         @arg @ref LL_FLASH_BANK_2
  * @param  page specifies the pages to be write protected.
  *         This parameter can be any combination of @ref LL_FLASH_OB_Write_Protection_Pages possible values.
  */
__STATIC_INLINE void LL_FLASH_OB_DisablePageWRP(FLASH_TypeDef *flashx, uint32_t bank, uint32_t page)
{
  __IO uint32_t *reg_addr = (bank == LL_FLASH_BANK_1) ? &flashx->WRP1R_PRG : &flashx->WRP2R_PRG;
  STM32_SET_BIT(*reg_addr, (FLASH_WRP1R_PRG_WRPSG1 & page));
}

/**
  * @brief  Get the flash page write protection flags by bank.
  * @rmtoll
  *  WRP1R_PRG/WRP2R_PRG          WRP1R_WRPSG/WRP2R_WRPSG          LL_FLASH_OB_IsEnabledPageWRP
  * @param  flashx FLASH instance.
  * @param  bank
  *         This parameter can be one of the following values:
  *         @arg @ref LL_FLASH_BANK_1
  *         @arg @ref LL_FLASH_BANK_2
  * @param  page specifies the pages to be write protected.
  *         This parameter can be any combination of @ref LL_FLASH_OB_Write_Protection_Pages possible values.
  * @retval 1 if all pages specified by the page parameter are write protected, 0 otherwise.
  */
__STATIC_INLINE uint32_t LL_FLASH_OB_IsEnabledPageWRP(const FLASH_TypeDef *flashx,
                                                      const uint32_t bank,
                                                      uint32_t page)
{
  const __IO uint32_t *reg_addr = (bank == LL_FLASH_BANK_1) ? &flashx->WRP1R_CUR : &flashx->WRP2R_CUR;
  return ((((~(STM32_READ_BIT(*reg_addr, FLASH_WRP1R_PRG_WRPSG1))) & page) == page) ? 1UL : 0UL);
}

/**
  * @brief  Set the flash start page for hide protection area by bank.
  * @rmtoll
  *  HDP1R_PRG/HDP2R_PRG          HDP1R_STRT/HDP2R_STRT          LL_FLASH_OB_SetHDPAreaStartPage
  * @param  flashx FLASH instance.
  * @param  bank
  *         This parameter can be one of the following values:
  *         @arg @ref LL_FLASH_BANK_1
  *         @arg @ref LL_FLASH_BANK_2
  * @param  page
  *         This parameter can be a value between 0x00U and the maximum number of pages by bank.
  */
__STATIC_INLINE void LL_FLASH_OB_SetHDPAreaStartPage(FLASH_TypeDef *flashx, uint32_t bank, uint32_t page)
{
  __IO uint32_t *reg_addr = (bank == LL_FLASH_BANK_1) ? &flashx->HDP1R_PRG : &flashx->HDP2R_PRG;
  STM32_MODIFY_REG(*reg_addr, FLASH_HDP1R_PRG_HDP1_STRT, page << FLASH_HDP1R_PRG_HDP1_STRT_Pos);
}

/**
  * @brief  Get the flash start page for hide protection area by bank.
  * @rmtoll
  *  HDP1R_CUR/HDP2R_CUR          HDP1R_STRT/HDP2R_STRT          LL_FLASH_OB_GetHDPAreaStartPage
  * @param  flashx FLASH instance.
  * @param  bank
  *         This parameter can be one of the following values:
  *         @arg @ref LL_FLASH_BANK_1
  *         @arg @ref LL_FLASH_BANK_2
  * @retval Returned value can be a value between 0x00U and the maximum number of pages by bank.
  */
__STATIC_INLINE uint32_t LL_FLASH_OB_GetHDPAreaStartPage(const FLASH_TypeDef *flashx, const uint32_t bank)
{
  const __IO uint32_t *reg_addr = (bank == LL_FLASH_BANK_1) ? &flashx->HDP1R_CUR : &flashx->HDP2R_CUR;
  return (STM32_READ_BIT(*reg_addr, FLASH_HDP1R_PRG_HDP1_STRT) >> FLASH_HDP1R_PRG_HDP1_STRT_Pos);
}

/**
  * @brief  Set the flash end page for hide protection area by bank.
  * @rmtoll
  *  HDP1R_PRG/HDP2R_PRG          HDP1R_END/HDP2R_END          LL_FLASH_OB_SetHDPAreaEndPage
  * @param  flashx FLASH instance.
  * @param  bank
  *         This parameter can be one of the following values:
  *         @arg @ref LL_FLASH_BANK_1
  *         @arg @ref LL_FLASH_BANK_2
  * @param  page
  *         This parameter can be a value between 0x00U and the maximum number of pages by bank.
  */
__STATIC_INLINE void LL_FLASH_OB_SetHDPAreaEndPage(FLASH_TypeDef *flashx, uint32_t bank, uint32_t page)
{
  __IO uint32_t *reg_addr = (bank == LL_FLASH_BANK_1) ? &flashx->HDP1R_PRG : &flashx->HDP2R_PRG;
  STM32_MODIFY_REG(*reg_addr, FLASH_HDP1R_PRG_HDP1_END, page << FLASH_HDP1R_PRG_HDP1_END_Pos);
}

/**
  * @brief  Get the flash end page for hide protection area by bank.
  * @rmtoll
  *  HDP1R_CUR/HDP2R_CUR          HDP1R_END/HDP2R_END          LL_FLASH_OB_GetHDPAreaEndPage
  * @param  flashx FLASH instance.
  * @param  bank
  *         This parameter can be one of the following values:
  *         @arg @ref LL_FLASH_BANK_1
  *         @arg @ref LL_FLASH_BANK_2
  * @retval Returned value can be a value between 0x00U and the maximum number of pages by bank.
  */
__STATIC_INLINE uint32_t LL_FLASH_OB_GetHDPAreaEndPage(const FLASH_TypeDef *flashx, const uint32_t bank)
{
  const __IO uint32_t *reg_addr = (bank == LL_FLASH_BANK_1) ? &flashx->HDP1R_CUR : &flashx->HDP2R_CUR;
  return (STM32_READ_BIT(*reg_addr, FLASH_HDP1R_PRG_HDP1_END) >> FLASH_HDP1R_PRG_HDP1_END_Pos);
}

/**
  * @brief  Configure the flash hide protection area by bank.
  * @rmtoll
  *  HDP1R_PRG/HDP2R_PRG        HDP1R_END|HDP1R_STRT/HDP2R_END|HDP2R_STRT      LL_FLASH_OB_ConfigHDPArea
  * @param  flashx FLASH instance.
  * @param  bank
  *         This parameter can be one of the following values:
  *         @arg @ref LL_FLASH_BANK_1
  *         @arg @ref LL_FLASH_BANK_2
  * @param  start_page
  *         This parameter can be a value between 0x00U and the maximum number of pages by bank.
  * @param  end_page
  *         This parameter can be a value between 0x00U and the maximum number of pages by bank.
  */
__STATIC_INLINE void LL_FLASH_OB_ConfigHDPArea(FLASH_TypeDef *flashx, uint32_t bank,
                                               uint32_t start_page,
                                               uint32_t end_page)
{
  __IO uint32_t *reg_addr = (bank == LL_FLASH_BANK_1) ? &flashx->HDP1R_PRG : &flashx->HDP2R_PRG;
  STM32_MODIFY_REG(*reg_addr, FLASH_HDP1R_PRG_HDP1_END | FLASH_HDP1R_PRG_HDP1_STRT, \
                   (end_page << FLASH_HDP1R_PRG_HDP1_END_Pos) + (start_page << FLASH_HDP1R_PRG_HDP1_STRT_Pos));
}

/**
  * @}
  */

/** @defgroup FLASH_LL_EF_ECC_Management LL FLASH ECC Management
  * @{
  */

/**
  * @brief  Get the flash ECC single-correction error address offset.
  * @rmtoll
  *  ECCCORR           ADDR_ECC           LL_FLASH_GetECCCAddressOffset
  * @param  flashx FLASH instance.
  * @retval Returned value : ECC single-correction error address offset.
  */
__STATIC_INLINE uint32_t LL_FLASH_GetECCCAddressOffset(const FLASH_TypeDef *flashx)
{
  return (STM32_READ_BIT(flashx->ECCCORR, FLASH_ECCCORR_ADDR_ECC) >> FLASH_ECCCORR_ADDR_ECC_Pos);
}

/**
  * @brief  Get the flash ECC single-correction error data flash flag.
  * @rmtoll
  *  ECCCORR           EDATA_ECC           LL_FLASH_IsActiveFlag_EDATA_ECCC
  * @param  flashx FLASH instance.
  * @retval State of ECC single-correction error data flash flag (1: ECC error in data flash / 0: not in data flash).
  */
__STATIC_INLINE uint32_t LL_FLASH_IsActiveFlag_EDATA_ECCC(const FLASH_TypeDef *flashx)
{
  return ((STM32_READ_BIT(flashx->ECCCORR, FLASH_ECCCORR_EDATA_ECC) == (FLASH_ECCCORR_EDATA_ECC)) ? 1UL : 0UL);
}

/**
  * @brief  Get the flash ECC single-correction error bank flag.
  * @rmtoll
  *  ECCCORR           BK_ECC           LL_FLASH_IsActiveFlag_BK_ECCC
  * @param  flashx FLASH instance.
  * @retval Returned value : ECC error bank (1: ECC error in Bank 2 / 0: ECC error in Bank 1).
  */
__STATIC_INLINE uint32_t LL_FLASH_IsActiveFlag_BK_ECCC(const FLASH_TypeDef *flashx)
{
  return ((STM32_READ_BIT(flashx->ECCCORR, FLASH_ECCCORR_BK_ECC) == (FLASH_ECCCORR_BK_ECC)) ? 1UL : 0UL);
}


/**
  * @brief  Get the flash ECC single-correction error system flash flag.
  * @rmtoll
  *  ECCCORR           SYSF_ECC           LL_FLASH_IsActiveFlag_SYSF_ECCC
  * @param  flashx FLASH instance.
  * @retval State of ECC single-correction error system flash flag
  *         (1: ECC error in system flash / 0: not in system flash).
  */
__STATIC_INLINE uint32_t LL_FLASH_IsActiveFlag_SYSF_ECCC(const FLASH_TypeDef *flashx)
{
  return ((STM32_READ_BIT(flashx->ECCCORR, FLASH_ECCCORR_SYSF_ECC) == (FLASH_ECCCORR_SYSF_ECC)) ? 1UL : 0UL);
}

/**
  * @brief  Get the flash ECC single-correction error OTP flash flag.
  * @rmtoll
  *  ECCCORR           OTP_ECC           LL_FLASH_IsActiveFlag_OTP_ECCC
  * @param  flashx FLASH instance.
  * @retval State of ECC single-correction error OTP flash flag (1: ECC error in OTP flash / 0: not in OTP flash).
  */
__STATIC_INLINE uint32_t LL_FLASH_IsActiveFlag_OTP_ECCC(const FLASH_TypeDef *flashx)
{
  return ((STM32_READ_BIT(flashx->ECCCORR, FLASH_ECCCORR_OTP_ECC) == (FLASH_ECCCORR_OTP_ECC)) ? 1UL : 0UL);
}

/**
  * @brief  Read the state of selected ECCC flags.
  * @rmtoll
  *  ECCCORR     EDATA_ECC|BK_ECC/SYSF_ECC|OTP_ECC      LL_FLASH_ReadFlag_ECCC
  * @param  flashx FLASH instance.
  * @param  flags
  *         This parameter can one or a combination of the following values:
  *         @arg @ref LL_FLASH_FLAG_EDATA_ECC
  *         @arg @ref LL_FLASH_FLAG_BK_ECC
  *         @arg @ref LL_FLASH_FLAG_SYSF_ECC
  *         @arg @ref LL_FLASH_FLAG_OTP_ECC
  *         @arg @ref LL_FLASH_FLAG_ECC_AREA_ALL
  * @retval Returned value : state of ECCC selected flags.
  */
__STATIC_INLINE uint32_t LL_FLASH_ReadFlag_ECCC(const FLASH_TypeDef *flashx, const uint32_t flags)
{
  return (STM32_READ_BIT(flashx->ECCCORR, flags));
}

/**
  * @brief  Enable the flash ECC single-correction error interrupt.
  * @rmtoll
  *  ECCCORR          ECCCIE        LL_FLASH_EnableIT_ECCC
  * @param  flashx FLASH instance.
  */
__STATIC_INLINE void LL_FLASH_EnableIT_ECCC(FLASH_TypeDef *flashx)
{
  STM32_SET_BIT(flashx->ECCCORR, FLASH_ECCCORR_ECCCIE);
}

/**
  * @brief  Disable the flash ECC single-correction error interrupt.
  * @rmtoll
  *  ECCCORR          ECCCIE        LL_FLASH_DisableIT_ECCC
  * @param  flashx FLASH instance.
  */
__STATIC_INLINE void LL_FLASH_DisableIT_ECCC(FLASH_TypeDef *flashx)
{
  STM32_CLEAR_BIT(flashx->ECCCORR, FLASH_ECCCORR_ECCCIE);
}

/**
  * @brief  Check if the flash ECC single-correction error interrupt is enabled or disabled.
  * @rmtoll
  *  ECCCORR          ECCCIE        LL_FLASH_IsEnabledIT_ECCC
  * @param  flashx FLASH instance.
  * @retval State of flash EOP interruption (1 enabled / 0 disabled).
  */
__STATIC_INLINE uint32_t LL_FLASH_IsEnabledIT_ECCC(const FLASH_TypeDef *flashx)
{
  return ((STM32_READ_BIT(flashx->ECCCORR, FLASH_ECCCORR_ECCCIE) == (FLASH_ECCCORR_ECCCIE)) ? 1UL : 0UL);
}

/**
  * @brief  Check if the flash ECC single-correction error flag is active.
  * @rmtoll
  *  ECCCORR           ECCC           LL_FLASH_IsActiveFlag_ECCC
  * @param  flashx FLASH instance.
  * @retval State of flash ECCC flag (1 active / 0 not active).
  */
__STATIC_INLINE uint32_t LL_FLASH_IsActiveFlag_ECCC(const FLASH_TypeDef *flashx)
{
  return ((STM32_READ_BIT(flashx->ECCCORR, FLASH_ECCCORR_ECCC) == (FLASH_ECCCORR_ECCC)) ? 1UL : 0UL);
}

/**
  * @brief  Clear the flash ECC single-correction error flag.
  * @rmtoll
  *  ECCCORR           ECCC           LL_FLASH_ClearFlag_ECCC
  * @param  flashx FLASH instance.
  */
__STATIC_INLINE void LL_FLASH_ClearFlag_ECCC(FLASH_TypeDef *flashx)
{
  STM32_SET_BIT(flashx->ECCCORR, FLASH_ECCCORR_ECCC);
}

/**
  * @brief  Get the flash ECC double error address offset.
  * @rmtoll
  *  ECCDETR           ADDR_ECC           LL_FLASH_GetECCDAddressOffset
  * @param  flashx FLASH instance.
  * @retval Returned value : ECC double error address offset.
  */
__STATIC_INLINE uint32_t LL_FLASH_GetECCDAddressOffset(const FLASH_TypeDef *flashx)
{
  return (STM32_READ_BIT(flashx->ECCDETR, FLASH_ECCDETR_ADDR_ECC) >> FLASH_ECCDETR_ADDR_ECC_Pos);
}

/**
  * @brief  Get the flash ECC double error data flash flag.
  * @rmtoll
  *  ECCDETR           EDATA_ECC           LL_FLASH_IsActiveFlag_EDATA_ECCD
  * @param  flashx FLASH instance.
  * @retval State of ECC double error data flash flag (1: ECC error in data flash / 0: not in data flash).
  */
__STATIC_INLINE uint32_t LL_FLASH_IsActiveFlag_EDATA_ECCD(const FLASH_TypeDef *flashx)
{
  return ((STM32_READ_BIT(flashx->ECCDETR, FLASH_ECCDETR_EDATA_ECC) == (FLASH_ECCDETR_EDATA_ECC)) ? 1UL : 0UL);
}

/**
  * @brief  Get the flash ECC double error bank flag.
  * @rmtoll
  *  ECCDETR           BK_ECC           LL_FLASH_IsActiveFlag_BK_ECCD
  * @param  flashx FLASH instance.
  * @retval Returned value : ECC error bank (1: ECC error in Bank 2 / 0: ECC error in Bank 1).
  */
__STATIC_INLINE uint32_t LL_FLASH_IsActiveFlag_BK_ECCD(const FLASH_TypeDef *flashx)
{
  return ((STM32_READ_BIT(flashx->ECCDETR, FLASH_ECCDETR_BK_ECC) == (FLASH_ECCDETR_BK_ECC)) ? 1UL : 0UL);
}

/**
  * @brief  Get the flash ECC double error system flash flag.
  * @rmtoll
  *  ECCDETR           SYSF_ECC           LL_FLASH_IsActiveFlag_SYSF_ECCD
  * @param  flashx FLASH instance.
  * @retval State of ECC double error system flash flag (1: ECC error in system flash / 0: not in system flash).
  */
__STATIC_INLINE uint32_t LL_FLASH_IsActiveFlag_SYSF_ECCD(const FLASH_TypeDef *flashx)
{
  return ((STM32_READ_BIT(flashx->ECCDETR, FLASH_ECCDETR_SYSF_ECC) == (FLASH_ECCDETR_SYSF_ECC)) ? 1UL : 0UL);
}

/**
  * @brief  Get the flash ECC double error OTP flash flag.
  * @rmtoll
  *  ECCDETR           OTP_ECC           LL_FLASH_IsActiveFlag_OTP_ECCD
  * @param  flashx FLASH instance.
  * @retval State of ECC double error OTP flash flag (1: ECC error in OTP flash / 0: not in OTP flash).
  */
__STATIC_INLINE uint32_t LL_FLASH_IsActiveFlag_OTP_ECCD(const FLASH_TypeDef *flashx)
{
  return ((STM32_READ_BIT(flashx->ECCDETR, FLASH_ECCDETR_OTP_ECC) == (FLASH_ECCDETR_OTP_ECC)) ? 1UL : 0UL);
}

/**
  * @brief  Read the state of selected ECCD flags.
  * @rmtoll
  *  ECCDETR     EDATA_ECC|BK_ECC/SYSF_ECC|OTP_ECC     LL_FLASH_ReadFlag_ECCD
  * @param  flashx FLASH instance.
  * @param  flags
  *         This parameter can one or a combination of the following values:
  *         @arg @ref LL_FLASH_FLAG_EDATA_ECC
  *         @arg @ref LL_FLASH_FLAG_BK_ECC
  *         @arg @ref LL_FLASH_FLAG_SYSF_ECC
  *         @arg @ref LL_FLASH_FLAG_OTP_ECC
  *         @arg @ref LL_FLASH_FLAG_ECC_AREA_ALL
  * @retval Returned value : state of ECCD selected flags.
  */
__STATIC_INLINE uint32_t LL_FLASH_ReadFlag_ECCD(const FLASH_TypeDef *flashx, const uint32_t flags)
{
  return (STM32_READ_BIT(flashx->ECCDETR, flags));
}


/**
  * @brief  Check if the flash ECC double error flag is active.
  * @rmtoll
  *  ECCDETR           ECCD           LL_FLASH_IsActiveFlag_ECCD
  * @param  flashx FLASH instance.
  * @retval State of flash ECCD flag (1 active / 0 not active).
  */
__STATIC_INLINE uint32_t LL_FLASH_IsActiveFlag_ECCD(const FLASH_TypeDef *flashx)
{
  return ((STM32_READ_BIT(flashx->ECCDETR, FLASH_ECCDETR_ECCD) == (FLASH_ECCDETR_ECCD)) ? 1UL : 0UL);
}

/**
  * @brief  Clear the flash ECC double error flag.
  * @rmtoll
  *  ECCDETR           ECCD           LL_FLASH_ClearFlag_ECCD
  * @param  flashx FLASH instance.
  */
__STATIC_INLINE void LL_FLASH_ClearFlag_ECCD(FLASH_TypeDef *flashx)
{
  STM32_SET_BIT(flashx->ECCDETR, FLASH_ECCDETR_ECCD);
}

/**
  * @brief  Get the flash ECC double error data.
  * @rmtoll
  *  ECCDR           DATA_ECC           LL_FLASH_GetECCDData
  * @param  flashx FLASH instance.
  * @retval Returned value : ECC error data.
  */
__STATIC_INLINE uint32_t LL_FLASH_GetECCDData(const FLASH_TypeDef *flashx)
{
  return (STM32_READ_BIT(flashx->ECCDR, FLASH_ECCDR_DATA_ECC) >> FLASH_ECCDR_DATA_ECC_Pos);
}

/**
  * @brief  Get the flash ECC double error 16-bit word number.
  * @rmtoll
  *  ECCDR         DATA_ADDR_ECC         LL_FLASH_GetECCDWordNumber
  * @param  flashx FLASH instance.
  * @retval Returned value : ECC error 16-bit word number.
  */
__STATIC_INLINE uint32_t LL_FLASH_GetECCDWordNumber(const FLASH_TypeDef *flashx)
{
  return (STM32_READ_BIT(flashx->ECCDR, FLASH_ECCDR_DATA_ADDR_ECC) >> FLASH_ECCDR_DATA_ADDR_ECC_Pos);
}

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

#endif /* FLASH */

/**
  * @}
  */

#ifdef __cplusplus
}
#endif /* __cplusplus */

#endif /* STM32C5XX_LL_FLASH_H */
